/*
 * 通过拼音、首字母、汉字的关联搜索城市名称的JS
 *只做一级索引就可以了，多了JS文件太大了
 * 崔宏威
 * V1.0
 * 2009-3-6
 */

var arPyIndex = new Array();
arPyIndex = [
	[['alashanmeng','alsm','阿拉善盟','483','14000000','14120000','FRDWJIXURDUVF','101.06902,41.95791'],['anshanshi','ass','鞍山市','412','15000000','15030000','HTWVTTXWRGEAH','122.98945,41.10662'],['anqingshi','aqs','安庆市','556','21000000','21080000','IEBEABWVBDAAR','117.05181,30.52717'],['anyangshi','ays','安阳市','372','25000000','25050000','HHHDVVXVFIVEW','114.34614,36.09561'],['abaqiangzuzizhizhou','abczqzzzz','阿坝','837','32000000','32190000','GTWCDHXTSHVSC','102.36364,30.99878'],['anshunshi','ass','安顺市','853','33000000','33040000','HJRFJIUTJSARS','105.93401,26.24562'],['alidiqu','aldq','阿里地区','897','35000000','35060000','FUUVCJWSIEVAR','91.13457,29.65145'],['ankangshi','aks','安康市','915','36000000','36090000','HEIHWSXUIDSWG','109.02352,32.68774'],['akesudiqu','aksdq','阿克苏地区','997','40000000','40080000','ECTRRTUTIIAJH','87.56985,43.83134'],['aletaidiqu','altdq','阿勒泰地区','906','40000000','40140000','ECSWBCXUBCBVW','90.38296,46.67415'],['alaershi','ales','阿拉尔市','997','40000000','40170000','DVDESFWSJVFBC','81.28059,40.54743'],['aomentebiexingzheengqu','amtbxzq','澳门特别行政区','8530','41020000','41020000','ISFUGBXTWAWUA','113.50000,22.20000']]
	,[['beijingshi','bjs','北京市','010','10000000','HETCUFWVVHUEE','116.3914,39.90496'],['baodingshi','bds','保定市','312','12000000','12060000','HEWFWUXVSIFJT','115.48452,38.86712'],['baotoushi','bts','包头市','472','14000000','14020000','GJJTBRWVFRBHD','109.83454,40.65621'],['benxishi','bxs','本溪市','414','15000000','15050000','HUVDSVXWSUJUF','123.76097,41.29204'],['baishanshi','bss','白山市','439','16000000','16060000','IAWUCBXBAAVSHT','126.4375,41.9375'],['baichengshi','bcs','白城市','436','16000000','16080000','HFVAVEWBABBABS','122.84375,45.625'],['bengbushi','bbs','蚌埠市','552','21000000','21030000','IAUUAAWVFFCHB','117.35312,32.93537'],['bozhoushi','bzs','亳州市','558','21000000','21150000','HUAIWVXVEFIFU','115.77861,33.86968'],['binzhoushi','bzs','滨州市','543','24000000','24160000','HSAWCDXVUBRBV','118.00056,37.38662'],['beihaishi','bhs','北海市','779','29000000','29050000','IFUDDRWTHDVRJ','109.12329,21.45376'],['baiseshi','bss','百色市','776','29000000','29100000','HVEDUGXTHCFWW','106.61442,23.89949'],['baishalizu','bslzzzx','白沙黎族自治县','898','30000000','30130000','IRBBFFUTEFASG','109.55357,19.10361'],['baotinglizu','btlzmzzzx','保亭黎族苗族自治县','898','30000000','30170000','IRBBFFUTEFASG','109.55357,19.10361'],['bazhongshi','bzs','巴中市','827','32000000','32170000','HCFGGWXUDIBVG','106.75586,31.85764'],['bijiediqu','bjdq','毕节地区','857','33000000','33070000','HHAGVRXTRFBBW','105.28092,27.30947'],['baoshanshi','bss','保山市','875','34000000','34040000','HBWICGXSTWUHB','99.25667,24.59982'],['baojishi','bjs','宝鸡市','917','36000000','36030000','GWDDUEXUIADTU','107.20552,34.36197'],['baiyinshi','bys','白银市','943','37000000','37040000','GRBWUGXUHDDWB','105.27547,35.7599'],['boertazizhizhou','betlmgzzz','博尔塔拉蒙古自治州','909','40000000','40060000','DITEADWTBTBVE','82.07435,44.90649'],['bayinguolezizhizhou','byglmgzzz','巴音郭楞蒙古自治州','996','40000000','40070000','EDTHJAUTDCSHF','86.14618,41.76027'],['bayannaoershi','bynes','巴彦淖尔市','478','14000000','14110000','GFSSFDWVCBBBI','107.39597,40.75915']]
	,[['chengdeshi','cds','承德市','314','12000000','12080000','HFHJHWXWCHACR','117.91916,40.9651'],['cangzhoushi','czs','沧州市','317','12000000','12090000','HHVAAFWVTTRDT','116.85496,38.32772'],['changzhishi','czs','长治市','355','13000000','13040000','HFGISAWVDTTJH','113.10075,36.18972'],['chifengshi','cfs','赤峰市','476','14000000','14040000','HFATDJXWFWWDI','118.94544,42.27112'],['chaoyangshi','cys','朝阳市','421','15000000','15130000','HIGHARXWHDRSH','120.44856,41.57567'],['changchunshi','ccs','长春市','431','16000000','16010000','HTESJCVBACCRUU','125.30831,43.8843'],['changzhoushi','czs','常州市','519','19000000','19040000','IGJFJWXVHIHDA','119.95071,31.78353'],['chuzhoushi','czs','滁州市','550','21000000','21100000','IDEJCAWVFUDAJ','118.31148,32.30621'],['chizhoushi','czs','池州市','566','21000000','21160000','IEIGTWXVCAUIC','117.48224,30.6637'],['changshashi','css','长沙市','731','27000000','27010000','IBGRTCVUHGRSF','112.97811,28.19746'],['changdeshi','cds','常德市','736','27000000','27070000','HVDAVWXUGSCRI','111.68547,29.01893'],['chenzhoushi','czs','郴州市','735','27000000','27100000','IFCBUEVUDUGGU','113.02264,25.80725'],['chaozhoushi','czs','潮州市','768','28000000','28190000','IUVFHTWUGATBU','116.6186,23.65945'],['chongzuoshi','czs','崇左市','771','29000000','29140000','IBSIUJXTFWTII','107.36648,22.38592'],['chengmaixian','cmx','澄迈县','898','30000000','30110000','IRACCTVTGCRUH','110.14105,19.7299'],['changjianglizu','cjlzzzx','昌江黎族自治县','898','30000000','30140000','IITGHRUTDHTGB','108.85829,19.25532'],['chongqingshi','cqs','重庆市','023','0','31000000','HFISFCXTWJRFB','106.52713,29.52744'],['chengdushi','cds','成都市','028','32000000','32010000','HAAUTSVTUJCFE','104.06247,30.66093'],['chuxiongzizhizhou','cxyzzzz','楚雄彝族自治州','878','34000000','34070000','HETSVRWTBCGHU','101.54635,25.03666'],['changdudiqu','cddq','昌都地区','895','35000000','35020000','GEJTEAXTEBWBU','97.21606,31.31415'],['changjizizhizhou','cjhzzzz','昌吉回族自治州','994','40000000','40050000','ECCBCUWTIFSVR','87.30595,44.00135']]
	,[['datongshi','dts','大同市','352','13000000','13020000','GWSVEUXVRAJVR','113.28883,40.09079'],['dalianshi','dls','大连市','411','15000000','15020000','HVDTTCXWEWAFW','121.61,38.91319'],['dandongshi','dds','丹东市','415','15000000','15060000','IAJTWAXWSADJB','124.37912,40.12537'],['daqingshi','dqs','大庆市','459','17000000','17060000','HHSSFDVBAFUUUG','125.02508,46.59178'],['daxinganlingdiqu','dxaldq','大兴安岭地区','457','17000000','17130000','HAIBSWXBARFEJR','124.12036,50.42198'],['dongyingshi','dys','东营市','546','24000000','24050000','HSUERIWVVBGCU','118.57602,37.45643'],['dezhoushi','dzs','德州市','534','24000000','24140000','HIEVBTWVRSSVF','116.32216,37.51309'],['dongguanshi','dgs','东莞市','769','28000000','28170000','IRHDSEVUASTDU','113.74928,23.04749'],['danzhoushi','dzs','儋州市','898','30000000','30050000','IIRSHRUTEAFBF','108.99871,19.46486'],['dongfangshi','dfs','东方市','898','30000000','30080000','IIRWUUXTCVTIA','108.64518,19.1001'],['dinganxian','dax','定安县','898','30000000','30090000','IRTVUIWTFTBGU','110.2681,19.33299'],['deyangshi','dys','德阳市','838','32000000','32050000','GWUIVAXTVTSAH','104.39499,31.12892'],['dazhoushi','dzs','达州市','818','32000000','32150000','HEGUGBXUDJWFE','107.47826,31.21058'],['dalizizhizhou','dlbzzzz','大理白族自治州','872','34000000','34120000','HBVUFHXSWWRSV','100.22242,25.59324'],['dehongzizhizhou','dhdzjpzzzz','德宏傣族景颇族自治州','692','34000000','34130000','HBDBVWXSSSGUC','98.58488,24.43546'],['diqingzizhizhou','dqczzzz','迪庆藏族自治州','887','34000000','34150000','GUSSBDVTCJJAT','99.70535,27.82629'],['dingxishi','dxs','定西市','932','37000000','37110000','GIVEUTWUFFCUH','104.25649,35.54726']]
	,[['eerduosishi','eedss','鄂尔多斯市','477','14000000','14060000','GSCEHBWVEJIIA','109.9976,39.81488'],['ezhoushi','ezs','鄂州市','711','26000000','26060000','IAWFGTXUURVVD','114.88127,30.401'],['enshi','estjzmzzzz','恩施土家族苗族自治州','718','26000000','26130000','HIVFGDWUFEDGA','109.48025,30.28391']]
	,[['fushunshi','fss','抚顺市','413','15000000','15040000','HUBGDJXWTSTTT','123.78842,41.84562'],['fuxinshi','fxs','阜新市','418','15000000','15090000','HJJCFJXWJSHWV','121.64739,42.00827'],['fuyangshi','fys','阜阳市','558','21000000','21110000','HVJGCUXVCWCGG','115.82881,32.90309'],['fuzhoushi','fzs','福州市','591','22000000','22010000','IVEJETWUUUASU','119.2918,26.07713'],['fuzhoushi','fzs','抚州市','794','23000000','23100000','IGUSGJVUTECUE','116.34806,28.00222'],['foshanshi','fss','佛山市','757','28000000','28060000','IJHTDHXTWSGTT','113.09785,23.02963'],['fangchenggangshi','fcgs','防城港市','770','29000000','29060000','IEGCDDUTGETBA','108.34041,21.61559']]
	,[['ganzhoushi','gzs','赣州市','797','23000000','23070000','IHWJHHXUGUEVV','114.93514,25.857'],['guangzhoushi','gzs','广州市','020','28000000','28010000','IJJDGAXUABUIW','113.25903,23.13152'],['guilinshi','gls','桂林市','773','29000000','29030000','IBTDWSXTVUJWG','110.2856,25.27654'],['guigangshi','ggs','贵港市','775','29000000','29080000','IEAUBJWTRHJFV','109.60019,23.09323'],['guangyuanshi','gys','广元市','839','32000000','32070000','HAAIBIXUCWGSS','105.82209,32.43514'],['guanganshi','gas','广安市','826','32000000','32140000','HEEGTJVUBDGJR','106.63945,30.47057'],['ganzizangzuzizhizhou','gzczzzz','甘孜','836','32000000','32200000','GTGIGRXTRJHAW','101.89076,30.87867'],['guiyangshi','gys','贵阳市','851','33000000','33010000','HRFBHUVTSGBFI','106.70786,26.57942'],['gannanzangzuzizhizhou','gnczzzz','甘南藏族自治州','941','37000000','37140000','GJAJGEWUDSUVJ','103.78494,34.98219'],['guoluozangzuzizhizhou','glczzzz','果洛藏族自治州','975','38000000','38060000','GFWVHGXTSUCVW','100.19338,33.38469'],['guyuanshi','gys','固原市','954','39000000','39040000','GSEGWRXUJBGBB','106.27037,35.99924'],['geermu','gem','格尔木市','979','38000000','38090000','FJFDDUVTIFTAE','94.9068,36.40076']]
	,[['handanshi','hds','邯郸市','310','12000000','12040000','HGVCGVWVGIBRD','114.47136,36.59331'],['hengshuishi','hss','衡水市','318','12000000','12110000','HGWVWTXVRBRAD','115.68599,37.73484'],['huhehaoteshi','hhhts','呼和浩特市','471','14000000','14010000','GTCIEDWVIRJSI','111.66293,40.81507'],['hulunbeiershi','hlbes','呼伦贝尔市','470','14000000','14070000','GSRVETWBABUCHH','119.75097,49.21534'],['huludaoshi','hlds','葫芦岛市','429','15000000','15140000','HREWBEXWGHVBH','120.83181,40.70954'],['haerbinshi','hebs','哈尔滨市','451','17000000','17010000','HSHWUDXBAHARIG','126.64452,45.7421'],['hegangshi','hgs','鹤岗市','468','17000000','17040000','HVREATXBAVVGWH','130.24985,47.28862'],['heiheshi','hhs','黑河市','456','17000000','17110000','HFVSSSXBAWDCSC','127.48942,50.24292'],['huaianshi','has','淮安市','517','19000000','19080000','ICGJGDWVIVFJA','119.03185,33.59935'],['hangzhoushi','hzs','杭州市','571','20000000','20010000','IJDATIWVFIIBH','120.15047,30.27536'],['huzhoushi','hzs','湖州市','572','20000000','20050000','IIDDFUWVGFRTV','120.09581,30.86945'],['hefeishi','hfs','合肥市','551','21000000','21010000','ICGCIJWVDJFGT','117.2821,31.86714'],['huainanshi','hns','淮南市','554','21000000','21040000','IASFHWXVEDVTE','116.94969,32.63307'],['huaibeishi','hbs','淮北市','561','21000000','21060000','HVHEGJXVFWWCI','116.78496,33.94568'],['huangshanshi','hss','黄山市','559','21000000','21090000','IHDTICWVBUURU','118.30895,29.71454'],['hezeshi','hzs','菏泽市','530','24000000','24170000','HRHRJJXVFWWUG','115.48303,35.24935'],['hebishi','hbs','鹤壁市','392','25000000','25060000','HHGUUJWVFADAE','114.16006,35.9251'],['huangshi','hss','黄石市','714','26000000','26020000','IBHVFUWUUJTDA','115.03262,30.20178'],['huanggangshi','hgs','黄冈市','713','26000000','26100000','IAVEGFWUUTFTT','114.8888,30.45212'],['hengyangshi','hys','衡阳市','734','27000000','27040000','ICUVVBXUEUWGE','112.62074,26.88746'],['huaihuashi','hhs','怀化市','745','27000000','27120000','HUUAJHVUBUGUR','109.97008,27.55018'],['huizhoushi','hzs','惠州市','752','28000000','28110000','ISGGRHVUBTSBE','114.40693,23.08319'],['heyuanshi','hys','河源市','762','28000000','28140000','IRUDSGVUDDIRH','114.68678,23.73921'],['hezhoushi','hzs','贺州市','774','29000000','29110000','IFAAHEXTWHGIU','111.54648,24.41653'],['hechishi','hcs','河池市','778','29000000','29120000','HWDWJUXTRJCFE','108.0584,24.69892'],['haikoushi','hks','海口市','898','30000000','30010000','IJUDBBWTGVIUT','110.32398,20.03342'],['honghezizhizhou','hhhnzyzzzz','红河哈尼族彝族自治州','873','34000000','34080000','HJTHJUVTBBDRC','103.15511,23.37963'],['hanzhongshi','hzs','汉中市','916','36000000','36070000','HAVCSFWUFTIRI','107.02598,33.07938'],['haidongdiqu','hddq','海东地区','972','38000000','38020000','GECHSAVUDIDHH','102.11051,36.507'],['haibeizangzuzizhizhou','hbczzzz','海北藏族自治州','970','38000000','38030000','FVTCREWUDDJJD','100.24819,38.18016'],['huangnanzangzuzizhizhou','hnczzzz','黄南藏族自治州','973','38000000','38040000','GFIHSWXUBUTDE','102.01937,35.51459'],['hainanzangzuzizhizhou','hnczzzz','海南藏族自治州','974','38000000','38050000','GFAIDTXTWCEFJ','100.96546,34.78711'],['haiximengguzuzangzuzizhizhou','hxmgzczzzz','海西蒙古族藏族自治州','977','38000000','38080000','FTAIBJWTRVGVA','96.62676,36.347'],['hamidiqu','hmdq','哈密地区','902','40000000','40040000','EUGDHFVUAATUE','93.51548,42.83224'],['hetiandiqu','htdq','和田地区','903','40000000','40110000','EEJSJJUSCJTFR','80.99153,36.06281']]
	,[['','','','','']]
	,[['jinchengshi','jcs','晋城市','356','13000000','13050000','HGBDAUWVCFJIA','112.84382,35.49666'],['jinzhongshi','jzs','晋中市','354','13000000','13070000','HCJBBBWVFISRI','112.74164,37.69332'],['jinzhoushi','jzs','锦州市','416','15000000','15070000','HRCDJSXWHJFER','121.13354,41.12256'],['jilinshi','jls','吉林市','432','16000000','16020000','HVCVBJWBAEBVVR','126.56601,43.90673'],['jixishi','jxs','鸡西市','467','17000000','17030000','ICTGRSXBATWDAG','130.96496,45.29366'],['jiamusishi','jmss','佳木斯市','454','17000000','17080000','HWIIDTXBAVFCBW','130.35141,46.80602'],['jiaxingshi','jxs','嘉兴市','573','20000000','20040000','IJFTGAWVHDDBJ','120.75284,30.76613'],['jinhuashi','jhs','金华市','579','20000000','20070000','IRDGFTXVCWSAH','119.64937,29.10462'],['jingdezhenshi','jdzs','景德镇市','798','23000000','23020000','IGDEDJXUWIJUI','117.208,29.29016'],['jiujiangshi','jjs','九江市','792','23000000','23040000','IDTAGCWUVFTBB','116.01809,29.70752'],['jianshi','jas','吉安市','796','23000000','23080000','IGBGBSXUITWCA','114.96437,27.12363'],['jinanshi','jns','济南市','531','24000000','24010000','HRJVAAWVRHFFU','116.9895,36.66519'],['jiningshi','jns','济宁市','537','24000000','24080000','HSVHDJWVHVUUR','116.58209,35.41497'],['jiaozuoshi','jzs','焦作市','391','25000000','25080000','HHBCJJXVCIHWI','113.2304,35.22904'],['jingmenshi','jms','荆门市','724','26000000','26070000','HSVJRCWURJETS','112.21134,31.03805'],['jingzhoushi','jzs','荆州市','716','26000000','26090000','HUARAVWUJIHSU','112.23613,30.32448'],['jiangmenshi','jms','江门市','750','28000000','28070000','IRCSTCXTWBEAW','113.11424,22.59663'],['jieyangshi','jys','揭阳市','663','28000000','28200000','IURJHGVUFHRSU','116.35569,23.5502'],['jiayuguanshi','jygs','嘉峪关市','937','37000000','37020000','FJEGJHWUCRVGI','98.27287,39.79921'],['jinchangshi','jcs','金昌市','935','37000000','37030000','GAWHSFXUFUSCV','101.83369,38.31909'],['jiuquanshi','jqs','酒泉市','937','37000000','37090000','FJSRCIXUCWGEW','98.51283,39.74332'],['jiyuanshi','jys','济源市','390','25000000','25180000','HGEJDIZVBFESF','112.57934,35.09351']]
	,[['kaifengshi','kfs','开封市','378','25000000','25020000','HJGVEGXVDIWGW','114.34034,34.79357'],['kunmingshi','kms','昆明市','871','34000000','34010000','HGIVRBXTCWBDG','102.71043,25.04691'],['kelamayishi','klmys','克拉玛依市','990','40000000','40020000','DSWSFGXTHBGBW','84.87442,45.59885'],['kezilesukeerkezizizhizhou','kzlskekzzzz','克孜勒苏柯尔克孜自治州','908','40000000','40090000','DHRTUJVSAUCTG','76.16807,39.71487'],['kashendiqu','ksdq','喀什地区','998','40000000','40100000','DHTHFUVSACTIT','75.98924,39.46816']]
	,[['langfangshi','lfs','廊坊市','316','12000000','12100000','HFTVWAXVVFSCH','116.69091,39.51812'],['linfenshi','lfs','临汾市','357','13000000','13100000','HDCJHGWVBDIBB','111.51899,36.08054'],['lvliangshi','lls','吕梁市','358','13000000','13110000','HAGDSSXVCUGWA','111.14157,37.52003'],['liaoyangshi','lys','辽阳市','419','15000000','15100000','HUARIJXWRVRWI','123.1772,41.26432'],['liaoyuanshi','lys','辽源市','437','16000000','16040000','HUIVVIWBAAGBVH','125.13727,42.88552'],['lianyungangshi','lygs','连云港市','518','19000000','19070000','IBBRSJWVRREAV','119.17499,34.59923'],['lishuishi','lss','丽水市','578','20000000','20110000','ISRHIDWVCGJFI','119.93541,28.44563'],['liuanshi','las','六安市','564','21000000','21140000','IBFVUSXVCDSWT','116.50755,31.75737'],['longyanshi','lys','龙岩市','597','22000000','22080000','ITFETFWUIUVJR','117.03047,25.09715'],['laiwushi','lws','莱芜市','634','24000000','24120000','HTFICSXVRTHWC','117.66118,36.20492'],['linyishi','lys','临沂市','539','24000000','24130000','HWCGUDXVRBAVT','118.34679,35.05077'],['liaochengshi','lcs','聊城市','635','24000000','24150000','HJFDFSWVIJVDI','115.96321,36.48535'],['luoyangshi','lys','洛阳市','379','25000000','25030000','HGTWWBXVAGHFV','112.44799,34.61727'],['luoheshi','lhs','漯河市','395','25000000','25110000','HRTGHIWVBDFUU','114.0109,33.58299'],['loudishi','lds','娄底市','738','27000000','27130000','IAJWDWXUFDIAV','111.99742,27.73776'],['liuzhoushi','lzs','柳州市','772','29000000','29020000','IBVATEWTTBBTS','109.41087,24.32812'],['laibinshi','lbs','来宾市','772','29000000','29130000','ICICDUWTRVDHE','109.23056,23.73444'],['lingaoxian','lgx','临高县','898','30000000','30120000','IJCWHHXTFWHET','109.80537,19.93363'],['ledonglizu','ldlzzzx','乐东黎族自治县','898','30000000','30150000','IRAIGAWTCFHVF','108.89594,18.46891'],['lingshuilizu','lslzzzx','陵水黎族自治县','898','30000000','30160000','ISTCTDWTEFEAV','110.11264,18.5531'],['luzhoushi','lzs','泸州市','830','32000000','32040000','HEUSFAXTTWJSS','105.44093,28.89182'],['leshanshi','lss','乐山市','833','32000000','32100000','HBEBFWXTSGWFC','103.756,29.56706'],['liangshanlizuzizhizhou','lsyzzzz','凉山','834','32000000','32210000','HBBJHHWTESSVG','101.50918,27.4224'],['liupanshuishi','lpss','六盘水市','858','33000000','33020000','HHHUGFVTIJBGG','104.85949,26.58473'],['lijiangshi','ljs','丽江市','888','34000000','34060000','GWWHFRXTBWCCW','100.22428,26.88019'],['lincangshi','lcs','临沧市','883','34000000','34160000','HEFFFDVSUCJGI','100.08757,23.88147'],['lasashi','lss','拉萨市','891','35000000','35010000','FUUVCJWSIEVAR','91.13457,29.65145'],['linzhidiqu','lzdq','林芝地区','894','35000000','35070000','GBGEJCXSJWBJF','92.82667,29.03338'],['lanzhoushi','lzs','兰州市','931','37000000','37010000','GHHFWWXUFHFVE','103.83177,36.06171'],['longnanshi','lns','陇南市','939','37000000','37120000','GUEDUVXUCWCTJ','104.91051,33.33662'],['linxiahuizuzizhizhou','lxhzzzz','临夏回族自治州','930','37000000','37130000','GHFWWIXUDTGWB','103.25196,35.53829']]
	,[['mudanjiangshi','mdjs','牡丹江市','453','17000000','17100000','IBTVJCXBAJTWCB','129.61841,44.58224'],['maanshanshi','mass','马鞍山市','555','21000000','21050000','IEHRWSXVFDABT','118.49443,31.70617'],['maomingshi','mms','茂名市','668','28000000','28090000','IICVSCXTRDWRD','110.88002,21.66561'],['meizhoushi','mzs','梅州市','753','28000000','28120000','ITCCETVUGDGIS','116.09539,24.29128'],['mianyangshi','mys','绵阳市','816','32000000','32060000','GWUSAIXTWUFDH','104.73847,31.46688'],['meishanshi','mss','眉山市','028','32000000','32120000','HAJUAIVTTFRFF','103.84646,30.07823']]
	,[['nanjingshi','njs','南京市','025','19000000','19010000','IEGEITWVGCVHF','118.79128,32.06045'],['nantongshi','nts','南通市','513','19000000','19060000','IHSFJSWVJECVR','120.8873,31.98288'],['ningboshi','nbs','宁波市','574','20000000','20020000','ISVUHUWVHAUFE','121.5456,29.87668'],['nanpingshi','nps','南平市','599','22000000','22070000','ISSGHCXUTWJGD','118.17282,26.64481'],['ningdeshi','nds','宁德市','593','22000000','22090000','IUTHDHXUWBCGA','119.53699,26.65533'],['nanchangshi','ncs','南昌市','791','23000000','23010000','IFCEUTVUTJJDU','115.89732,28.67417'],['nanyangshi','nys','南阳市','377','25000000','25130000','HJGEVGXUVAWHW','112.52618,33.00341'],['nanningshi','nns','南宁市','771','29000000','29010000','ICJESUVTICRUG','108.36257,22.81909'],['neijiangshi','njs','内江市','832','32000000','32090000','HDDDRIXTUGWRS','105.04961,29.58506'],['nanchongshi','ncs','南充市','817','32000000','32110000','HCVSESWUAUSTT','106.07843,30.79913'],['nujiangzizhizhou','njlszzzz','怒江傈僳族自治州','886','34000000','34140000','GWHEFFXSVEJIR','98.85767,25.84899'],['naqudiqu','nqdq','那曲地区','896','35000000','35050000','FIHWJEXSGRTDB','88.84026,30.87607']]
	,[['aomentebiexingzhengqu','amtbxzq','澳门特别行政区','853','41020000','41020000','ISFUGBXTWAWUA','113.50000,22.20000']]
	,[['panjinshi','pjs','盘锦市','427','15000000','15110000','HSIWVFXWIWWHC','122.06339,41.11983'],['putianshi','pts','莆田市','594','22000000','22030000','IVUDRUWUTGIEV','119.00757,25.43865'],['pingxiangshi','pxs','萍乡市','799','23000000','23030000','IDJUIJVUHUTGA','113.84396,27.6226'],['pingdingshanshi','pdss','平顶山市','375','25000000','25040000','HJHARHWVAFTSR','113.29544,33.74258'],['puyangshi','pys','濮阳市','393','25000000','25090000','HJATJEWVGBSDJ','115.04958,35.75291'],['panzhihuashi','pzhs','攀枝花市','812','32000000','32030000','HCRHCWXTDSAST','101.67629,26.57135'],['puershi','pes','普洱市','879','34000000','34100000','HHFUJHVSTUGJT','100.97521,22.78187'],['pingliangshi','pls','平凉市','933','37000000','37080000','GUATRJVUITGUG','106.74967,35.31711']]
	,[['qinhuangdaoshi','qhds','秦皇岛市','335','12000000','12030000','HJJVGFXWDGIEG','119.59469,39.92473'],['qiqihaershi','qqhes','齐齐哈尔市','452','17000000','17020000','HEWGJRXBAFGFFH','123.96368,47.34471'],['qitaiheshi','qths','七台河市','464','17000000','17090000','IBVBJCXBAUJWST','130.89278,45.80798'],['quzhoushi','qzs','衢州市','570','20000000','20080000','IJEDARWVBJCGD','118.8763,28.95445'],['quanzhoushi','qzs','泉州市','595','22000000','22050000','IVWVHJXURWGTT','118.58938,24.9109'],['qingdaoshi','qds','青岛市','532','24000000','24020000','IASDGIWVVSGIU','120.37714,36.06587'],['qianjiangshi','qjs','潜江市','728','26000000','26150000','HUTUJWXURUAEC','112.90696,30.49466'],['qingyuanshi','qys','清远市','763','28000000','28160000','IIGRBSVUAREBT','113.05075,23.68425'],['qinzhoushi','qzs','钦州市','777','29000000','29070000','IEEGFDWTHECVG','108.62068,21.96722'],['qionghaishi','qhs','琼海市','898','30000000','30040000','ISDSGDWTFVTDR','110.46182,19.24884'],['qiongzhonglizu','qzlzmzzzx','琼中黎族苗族自治县','898','30000000','30180000','ISFERAUTESCIH','110.09259,18.815'],['qianxinanbuyizumiaozuzizhizhou','qxnbyzmzzzz','黔西南布依族苗族自治州','859','33000000','33060000','HRCSHRXTHTWBD','105.48894,25.45781'],['qiandongnanmiaozudongzuzizhizhou','qdnmzdzzzz','黔东南苗族侗族自治州','855','33000000','33080000','HTDWUAXTUFCTB','107.97728,26.58337'],['qiannanbuyizumiaozuzizhizhou','qnbyzmzzzz','黔南布依族苗族自治州','854','33000000','33090000','HTGAECUTTFIJB','107.69857,26.2216'],['qujingshi','qjs','曲靖市','874','34000000','34020000','HHIEFUVTFESHI','103.79586,25.50326'],['qingyangshi','qys','庆阳市','934','37000000','37100000','GUACGTVURRDCJ','107.34626,35.93991']]
	,[['rizhaoshi','rzs','日照市','633','24000000','24110000','IAFTHRWVTFJJS','119.49154,35.40281'],['rikazediqu','rkzdq','日喀则地区','892','35000000','35040000','FFUJAJVSCBCHR','86.46425,30.23713']]
	,[['shijiazhuangshi','sjzs','石家庄市','311','12000000','12010000','HESSBDWVITGDA','114.50873,38.04215'],['shuozhoushi','szs','朔州市','349','13000000','13060000','GWJHIEXVHJBJF','112.4298,39.33105'],['shenyangshi','sys','沈阳市','024','15000000','15010000','HTJIVBXWTBVUC','123.42577,41.80385'],['sipingshi','sps','四平市','434','16000000','16030000','HSVTGJXWWJIIE','124.34382,43.16342'],['songyuanshi','sys','松原市','438','16000000','16070000','HJRDVSWBADGAFV','124.83452,45.15042'],['shuangyashanshi','syss','双鸭山市','469','17000000','17050000','IBADECXBAWERIH','131.15452,46.63883'],['suqianshi','sqs','宿迁市','527','19000000','19130000','IASVJUWVIFASV','118.29509,33.95513'],['suzhoushi','szs','宿州市','557','21000000','21120000','HWDSDFXVFUGHA','116.9873,33.6391'],['suihuashi','shs','绥化市','455','17000000','17120000','HRRIUJXBAIVWBI','126.9896,46.63752'],['shanghaishi','shs','上海市','021','0','18000000','IJSRVJXVIWCHC','121.44645,31.21773'],['suzhoushi','szs','苏州市','512','19000000','19050000','IIFEWRXVHTWVS','120.61642,31.30401'],['shaoxingshi','sxs','绍兴市','575','20000000','20060000','IREBUTXVFTERW','120.57757,30.00338'],['sanmingshi','sms','三明市','598','22000000','22040000','ISHCWSXUSIFFT','117.61027,26.25497'],['shangraoshi','srs','上饶市','793','23000000','23110000','IIRAGFXUWHABR','117.96887,28.46339'],['sanmenxiashi','smxs','三门峡市','398','25000000','25120000','HERHERWUVSTUF','111.19463,34.7787'],['shangqiushi','sqs','商丘市','370','25000000','25140000','HSWBAEXVEWSCS','115.62863,34.43644'],['shiyanshi','sys','十堰市','719','26000000','26030000','HHEGSCXURTGGW','110.7556,32.62087'],['suizhoushi','szs','随州市','722','26000000','26120000','HTRADCXUUGCVW','113.36424,31.72359'],['shaoyangshi','sys','邵阳市','739','27000000','27050000','IAJDWAXUDRJDW','111.47247,27.24176'],['shaoguanshi','sgs','韶关市','751','28000000','28020000','IHIJCWXUDDDST','113.60205,24.81135'],['shenzhenshi','szs','深圳市','755','28000000','28030000','ISSGSEVUAHSIH','114.07989,22.55122'],['shantoushi','sts','汕头市','754','28000000','28050000','IVHBSGXUFSBTW','116.6825,23.36437'],['shanweishi','sws','汕尾市','660','28000000','28130000','IUFBIWXUCTDFT','115.35309,22.77263'],['sanyashi','sys','三亚市','898','30000000','30020000','ISESAGXTCWCTB','109.50715,18.25414'],['suiningshi','sns','遂宁市','825','32000000','32080000','HCJJUFXTWRIGC','105.58067,30.50991'],['shannandiqu','sndq','山南地区','893','35000000','35030000','GAUUJGXSJSWBU','92.58929,29.14156'],['shangluoshi','sls','商洛市','914','36000000','36100000','HECAUSVUSGTDC','109.9363,33.86452'],['shizuishanshi','szss','石嘴山市','952','39000000','39020000','GGUHDAVUUUTTD','106.38161,39.0181'],['shihezishi','shzs','石河子市','993','40000000','40150000','DWSVGEXTGVCSH','86.04133,44.30034']]
	,[['tianjinshi','tjs','天津市','022','0','11000000','HHCIWHXVVJDBG','117.20542,39.1468'],['tangshanshi','tss','唐山市','315','12000000','12020000','HHVGWIXWATJWU','118.17426,39.62923'],['taiyuanshi','tys','太原市','351','13000000','13010000','HCAFICWVFITUB','112.56449,37.87344'],['tongliaoshi','tls','通辽市','475','14000000','14050000','HIAVSEXWUBUFJ','122.26398,43.61723'],['tielingshi','tls','铁岭市','410','15000000','15120000','HTHUTAXWUHRUU','123.83654,42.28407'],['tonghuashi','ths','通化市','435','16000000','16050000','IAISAHXWWUEDI','125.93399,41.72609'],['taizhoushi','tzs','泰州市','523','19000000','19120000','IFGWVFXVIIUDV','119.91017,32.49493'],['taizhoushi','tzs','台州市','576','20000000','20100000','IUJHGTWVFADDF','121.42248,28.66317'],['tonglingshi','tls','铜陵市','562','21000000','21070000','IEJTFVWVCVFJF','117.78641,30.91268'],['taianshi','tas','泰安市','538','24000000','24090000','HSIVBAXVJWASD','117.12697,36.1881'],['tianmenshi','tms','天门市','728','26000000','26160000','HUWDRUXUSHHSG','113.17001,30.66029'],['tunchangxian','tcx','屯昌县','898','30000000','30100000','IRHWEFXTFIUWC','110.10035,19.36895'],['tongchuanshi','tcs','铜川市','919','36000000','36020000','HBAIDHVUSHRUC','108.94044,34.89782'],['tianshuishi','tss','天水市','938','37000000','37050000','GTJJSRWUGBFVB','105.72069,34.58236'],['tulufandiqu','tlfdq','吐鲁番地区','995','40000000','40030000','EGJJHVXTJJSAW','89.17918,42.94513'],['tachengdiqu','tcdq','塔城地区','901','40000000','40130000','DIRDBBXTGJWFR','83.62637,46.54285'],['tumushukeshi','tmsks','图木舒克市','998','40000000','40180000','DSVCUTWSFIBTU','79.08268,39.86977'],['tongrendiqu','trdq','铜仁地区','856','33000000','33100000','HTFVTIWUAVFID','109.18781,27.71462']]
	,[['','','','','']]
	,[['','','','','']]
	,[['wuhaishi','whs','乌海市','473','14000000','14030000','GGIDUGXUWIHIB','106.82115,39.67102'],['wulanchabushi','wlcbs','乌兰察布市','474','14000000','14100000','GVVIGHWVRETEV','113.10002,40.44956'],['wuxishi','wxs','无锡市','510','19000000','19020000','IHHBVAWVHSRRD','120.29849,31.56746'],['wenzhoushi','wzs','温州市','577','20000000','20030000','IUHWCDXVCVDGR','120.69534,27.9982'],['wuhushi','whs','芜湖市','553','21000000','21020000','IEUISRWVEGSBF','118.36223,31.33398'],['weifangshi','wfs','潍坊市','536','24000000','24070000','HUTJUUWVUSVIC','119.10535,36.70267'],['weihaishi','whs','威海市','631','24000000','24100000','IBCERRXWDJCCD','122.1139,37.51269'],['wuhanshi','whs','武汉市','027','26000000','26010000','HWTARHXUUAIWI','114.27367,30.58385'],['wuzhoushi','wzs','梧州市','774','29000000','29040000','IGAVVHWTURICV','111.30082,23.47852'],['wuzhishanshi','wzss','五指山市','898','30000000','30030000','IRICISUTDTCCC','109.51598,18.7762'],['wenchangshi','wcs','文昌市','898','30000000','30060000','ISESAAXTGWABJ','110.81444,19.56149'],['wanningshi','wns','万宁市','898','30000000','30070000','ISJHVWXTFRUDV','110.49966,19.04976'],['wenshanzhuangzumiaozuzizhizhou','wszzmzzzz','文山壮族苗族自治州','876','34000000','34090000','HUIFRHWTERVDI','105.56231,23.33425'],['weinanshi','wns','渭南市','913','36000000','36050000','HCHWJSXUSSSTR','109.5041,34.50048'],['wuweishi','wws','武威市','935','37000000','37060000','GDIUECVUGJIIH','102.92284,37.71467'],['wuzhongshi','wzs','吴忠市','953','39000000','39030000','GHVGSBXUSUWDT','106.07694,38.01838'],['wulumuqishi','wlmqs','乌鲁木齐市','991','40000000','40010000','ECUVDCXTIIWGF','87.61379,43.8253'],['wujiaqushi','wjqs','五家渠市','994','40000000','40160000','ECDHCJWTIVUUR','87.52089,44.16001']]
	,[['xingtaishi','xts','邢台市','319','12000000','12050000','HGDDSHWVHDJBV','114.48258,37.0518'],['xinzhoushi','xzs','忻州市','350','13000000','13090000','HBHFJSWVGJVDT','112.73027,38.40761'],['xinganmeng','xam','兴安盟','482','14000000','14080000','HEADFHWBAAIUVR','122.06584,46.06962'],['xilinguolemeng','xlglm','锡林郭勒盟','479','14000000','14090000','GVCBEIXWEDACB','116.08588,43.94517'],['xuzhoushi','xzs','徐州市','516','19000000','19030000','HVJFUDXVHBGWE','117.18587,34.26105'],['xuanchengshi','xcs','宣城市','563','21000000','21170000','IGAREWXVEGSDE','118.75353,30.94299'],['xiamenshi','xms','厦门市','592','22000000','22020000','IVVJBBWUJJGJI','118.11116,24.48748'],['xinyushi','xys','新余市','790','23000000','23050000','IEWTJDXUJTWJR','114.9323,27.81228'],['xinxiangshi','xxs','新乡市','373','25000000','25070000','HHWEWDXVDJSIC','113.87282,35.292'],['xuchangshi','xcs','许昌市','374','25000000','25100000','HJTUEIWVBJITU','113.81858,34.02859'],['xinyangshi','xys','信阳市','376','25000000','25150000','HUBFDBXUWBFVV','114.07079,32.13063'],['xiangfanshi','xfs','襄樊市','710','26000000','26050000','HRDVUGWUTBDJS','112.15504,32.07435'],['xiaoganshi','xgs','孝感市','712','26000000','26080000','HVRTTVWUUABHD','113.91096,30.92731'],['xianningshi','xns','咸宁市','715','26000000','26110000','IAWSBAXUSWJRF','114.32882,29.83411'],['xiantaoshi','xts','仙桃市','728','26000000','26140000','HVTWEFXUSGVDC','113.43891,30.36703'],['xiangtanshi','xts','湘潭市','731','27000000','27030000','IBUTBWXUGTIBI','112.91507,27.84421'],['xiangxizizhizhou','xxtjzmzzzz','湘西土家族苗族自治州','743','27000000','27140000','HTESRDVUCRFHC','109.73666,28.31248'],['xushuangbannazizhizhou','xsbndzzzz','西双版纳傣族自治州','691','34000000','34110000','HIFGDITSSDRAH','100.76535,21.93552'],['xianshi','xas','西安市','029','36000000','36010000','HBWVHUXURIDUI','108.93954,34.26646'],['xianyangshi','xys','咸阳市','910','36000000','36040000','HBIJRTVUREBED','108.70479,34.33076'],['xiningshi','xns','西宁市','971','38000000','38010000','GDIATWXUDCTBA','101.78503,36.60873'],['xianggangshi','xgs','香港市','8520','85200000','85200000','ITDEADZUAEEVV','114.1704,22.32094']]
	,[['yangquanshi','yqs','阳泉市','353','13000000','13030000','HDIVBIXVHAUWW','113.56003,37.86396'],['yunchengshi','ycs','运城市','359','13000000','13080000','HDWEIIXUVUARJ','110.9912,35.03289'],['yingkoushi','yks','营口市','417','15000000','15080000','HTICHAXWIIVUJ','122.22972,40.66525'],['yanbianzizhizhou','ybcxzzzz','延边朝鲜族自治州','433','16000000','16090000','IEDCFHJBAHBEBG','129.5067,42.9044'],['yichunshi','ycs','伊春市','458','17000000','17070000','HSVGSRXBAUHUFW','128.88932,47.72347'],['yanchengshi','ycs','盐城市','515','19000000','19090000','IEGSSTXVRDWJB','120.1331,33.38387'],['yangzhoushi','yzs','扬州市','514','19000000','19100000','IEUWEUXVHRSJG','119.43625,32.39117'],['yingtanshi','yts','鹰潭市','701','23000000','23060000','IHIGSDXUURWRT','117.03431,28.24997'],['yichunshi','ycs','宜春市','795','23000000','23090000','IECIHHWUIVVEV','114.37242,27.7954'],['yantaishi','yts','烟台市','535','24000000','24060000','HWWUHDXWCHRJC','121.37818,37.53272'],['yichangshi','ycs','宜昌市','717','26000000','26040000','HSATBHVUISGJI','111.31567,30.70953'],['yueyangshi','yys','岳阳市','730','27000000','27060000','HWURCEXUJHAEH','113.12781,29.37274'],['yiyangshi','yys','益阳市','737','27000000','27090000','HWVBGTXUHAUAB','112.3547,28.58099'],['yongzhoushi','yzs','永州市','746','27000000','27110000','ICFFDFVUCFEIT','111.61144,26.2306'],['yangjiangshi','yjs','阳江市','662','28000000','28150000','IJJSIAWTTDVVF','112.00138,21.85307'],['yunfushi','yfs','云浮市','766','28000000','28210000','IIASCRWTUVSES','112.0373,22.91385'],['yulinshi','yls','玉林市','775','29000000','29090000','IFJTJCUTRJRJH','110.15404,22.62443'],['yibinshi','ybs','宜宾市','831','32000000','32130000','HDUGBFVTSIUDG','104.63997,28.75961'],['yaanshi','yas','雅安市','835','32000000','32160000','GWHHIFXTRVTBA','103.00194,29.9851'],['yuxishi','yxs','玉溪市','877','34000000','34030000','HHFUSFXTBJWHG','102.54317,24.34953'],['yananshi','yas','延安市','911','36000000','36060000','GWEGGCXUVVHBH','109.48628,36.59523'],['yulinshi','yls','榆林市','912','36000000','36080000','GUBASHWVBUJHE','109.72781,38.28487'],['yushuzangzuzizhizhou','ysczzzz','玉树藏族自治州','976','38000000','38070000','FTGESRUTBTCEF','93.74935,33.23246'],['yinchuanshi','ycs','银川市','951','39000000','39010000','GHIDEDWUTUJVV','106.27056,38.46654'],['yilizizhizhou','ylhskzzz','伊犁哈萨克自治州','992','40000000','40120000','DJCBGWXSWBJWG','81.32362,43.9166']]
	,[['zhangjiakoushi','zjks','张家口市','313','12000000','12070000','HBBTDBWVUISAG','114.88499,40.79123'],['zhenjiangshi','zjs','镇江市','511','19000000','19110000','IFCRFFWVHGGAI','119.44326,32.2061'],['zhoushanshi','zss','舟山市','580','20000000','20090000','ITIHABXVIDIWA','122.1256,30.06368'],['zhangzhoushi','zzs','漳州市','596','22000000','22060000','IVCTCHWUIVUGC','117.65276,24.5127'],['ziboshi','zbs','淄博市','533','24000000','24030000','HTAVDJWVTEHVC','118.05797,36.79101'],['zaozhuangshi','zzs','枣庄市','632','24000000','24040000','HVDUUEWVIIUTH','117.55301,34.85346'],['zhengzhoushi','zzs','郑州市','371','25000000','25010000','HIGSCCWVCHAHF','113.64131,34.75794'],['zhoukoushi','zks','周口市','394','25000000','25160000','HSRTHWXVCDTSR','114.6418,33.62502'],['zhumadianshi','zmds','驻马店市','396','25000000','25170000','HSSISAWVAEVVB','114.02528,32.97729'],['zhuzhoushi','zzs','株洲市','731','27000000','27020000','ICDADVXUHCBWH','113.13778,27.85157'],['zhangjiajieshi','zjjs','张家界市','744','27000000','27080000','HTDAFAVUFABJD','110.47497,29.12074'],['zhuhaishi','zhs','珠海市','756','28000000','28040000','ISFTBFXTWEIUG','113.57133,22.27465'],['zhanjiangshi','zjs','湛江市','759','28000000','28080000','IHWRVIXTIUJEB','110.355,21.27317'],['zhaoqingshi','zqs','肇庆市','758','28000000','28100000','IIHDAVWTVUETJ','112.46915,23.07974'],['zhongshanshi','zss','中山市','760','28000000','28180000','IRRTRJXTWFUSG','113.37351,22.52591'],['zigongshi','zgs','自贡市','813','32000000','32020000','HDCHREUTTRFRF','104.77564,29.34185'],['ziyangshi','zys','资阳市','028','32000000','32180000','HBTAGFVTURCSI','104.63974,30.12562'],['zunyishi','zys','遵义市','852','33000000','33030000','HIWCRAXTUGIRU','106.9235,27.69327'],['zhaotongshi','zts','昭通市','870','34000000','34050000','HEJJVCXTHWGFJ','103.71445,27.33284'],['zhangyeshi','zys','张掖市','936','37000000','37070000','FUVTIBWUESBIC','100.45529,38.93545'],['zhongweishi','zws','中卫市','955','39000000','39050000','GIBFWTXURHDCJ','105.67146,37.49183']]
];


var arHZIndex1 = new Array();
arHZIndex1 = [
	'北','天','石','唐','秦','邯','邢','保','张','承','沧','廊','衡','太','大','阳','长','晋','朔','运','忻','临','吕','呼','包','乌','赤','通','鄂','兴','锡','阿','沈','鞍','抚','本','丹','锦','营','阜','辽','盘','铁','朝','葫','吉','四','白','松','延','哈','齐','鸡','鹤','双','伊','佳','七','牡','黑','绥','上','南','无','徐','常','苏','连','淮','盐','扬','镇','泰','宿','杭','宁','温','嘉','湖','绍','金','衢','舟','台','丽','合','芜','蚌','马','铜','安','黄','滁','巢','六','亳','池','宣','福','厦','莆','三','泉','漳','龙','景','萍','九','新','鹰','赣','宜','济','青','淄','枣','东','烟','潍','威','日','莱','德','聊','滨','菏','郑','开','洛','平','焦','濮','许','漯','商','信','周','驻','武','十','襄','荆','孝','咸','随','恩','仙','潜','株','湘','邵','岳','益','郴','永','怀','娄','广','韶','深','珠','汕','佛','江','湛','茂','肇','惠','梅','河','清','中','潮','揭','云','柳','桂','梧','防','钦','贵','玉','百','贺','来','崇','海','五','琼','儋','文','万','定','屯','澄','昌','乐','陵','重','成','自','攀','泸','绵','遂','内','眉','达','雅','巴','资','甘','凉','遵','黔','毕','昆','曲','昭','楚','红','普','西','怒','迪','拉','山','那','林','宝','渭','汉','榆','兰','酒','庆','陇','果','银','吴','固','克','吐','博','喀','和','塔','图','格','香','澳'];

var arHZIndex = new Array();
arHZIndex = [
	[['beijingshi','bjs','北京市','0','10000000','HETCUFWVVHUEE','116.3914,39.90496'],['beihaishi','bhs','北海市','29000000','29050000','IFUDDRWTHDVRJ','109.12329,21.45376']]
	,[['tianjinshi','tjs','天津市','0','11000000','HHCIWHXVVJDBG','117.20542,39.1468'],['tianmenshi','tms','天门市','26000000','26160000','HUWDRUXUSHHSG','113.17001,30.66029'],['tianshuishi','tss','天水市','37000000','37050000','GTJJSRWUGBFVB','105.72069,34.58236']]
	,[['shijiazhuangshi','sjzs','石家庄市','12000000','12010000','HESSBDWVITGDA','114.50873,38.04215'],['shizuishanshi','szss','石嘴山市','39000000','39020000','GGUHDAVUUUTTD','106.38161,39.0181'],['shihezishi','shzs','石河子市','40000000','40150000','DWSVGEXTGVCSH','86.04133,44.30034']]
	,[['tangshanshi','tss','唐山市','12000000','12020000','HHVGWIXWATJWU','118.17426,39.62923']]
	,[['qinhuangdaoshi','qhds','秦皇岛市','12000000','12030000','HJJVGFXWDGIEG','119.59469,39.92473']]
	,[['handanshi','hds','邯郸市','12000000','12040000','HGVCGVWVGIBRD','114.47136,36.59331']]
	,[['xingtaishi','xts','邢台市','12000000','12050000','HGDDSHWVHDJBV','114.48258,37.0518']]
	,[['baodingshi','bds','保定市','12000000','12060000','HEWFWUXVSIFJT','115.48452,38.86712'],['baotinglizu','btlzmzzzx','保亭黎族苗族自治县','30000000','30170000','IRBBFFUTEFASG','109.55357,19.10361'],['baoshanshi','bss','保山市','34000000','34040000','HBWICGXSTWUHB','99.25667,24.59982']]
	,[['zhangjiakoushi','zjks','张家口市','12000000','12070000','HBBTDBWVUISAG','114.88499,40.79123'],['zhangjiajieshi','zjjs','张家界市','27000000','27080000','HTDAFAVUFABJD','110.47497,29.12074'],['zhangyeshi','zys','张掖市','37000000','37070000','FUVTIBWUESBIC','100.45529,38.93545']]
	,[['chengdeshi','cds','承德市','12000000','12080000','HFHJHWXWCHACR','117.91916,40.9651']]
	,[['cangzhoushi','czs','沧州市','12000000','12090000','HHVAAFWVTTRDT','116.85496,38.32772']]
	,[['langfangshi','lfs','廊坊市','12000000','12100000','HFTVWAXVVFSCH','116.69091,39.51812']]
	,[['hengshuishi','hss','衡水市','12000000','12110000','HGWVWTXVRBRAD','115.68599,37.73484'],['hengyangshi','hys','衡阳市','27000000','27040000','ICUVVBXUEUWGE','112.62074,26.88746']]
	,[['taiyuanshi','tys','太原市','13000000','13010000','HCAFICWVFITUB','112.56449,37.87344']]
	,[['datongshi','dts','大同市','13000000','13020000','GWSVEUXVRAJVR','113.28883,40.09079'],['dalianshi','dls','大连市','15000000','15020000','HVDTTCXWEWAFW','121.61,38.91319'],['daqingshi','dqs','大庆市','17000000','17060000','HHSSFDVBAFUUUG','125.02508,46.59178'],['daxinganlingdiqu','dxaldq','大兴安岭地区','17000000','17130000','HAIBSWXBARFEJR','124.12036,50.42198'],['dalizizhizhou','dlbzzzz','大理白族自治州','34000000','34120000','HBVUFHXSWWRSV','100.22242,25.59324']]
	,[['yangquanshi','yqs','阳泉市','13000000','13030000','HDIVBIXVHAUWW','113.56003,37.86396'],['yangjiangshi','yjs','阳江市','28000000','28150000','IJJSIAWTTDVVF','112.00138,21.85307']]
	,[['changzhishi','czs','长治市','13000000','13040000','HFGISAWVDTTJH','113.10075,36.18972'],['changchunshi','ccs','长春市','16000000','16010000','HTESJCVBACCRUU','125.30831,43.8843'],['changshashi','css','长沙市','27000000','27010000','IBGRTCVUHGRSF','112.97811,28.19746']]
	,[['jinchengshi','jcs','晋城市','13000000','13050000','HGBDAUWVCFJIA','112.84382,35.49666'],['jinzhongshi','jzs','晋中市','13000000','13070000','HCJBBBWVFISRI','112.74164,37.69332']]
	,[['shuozhoushi','szs','朔州市','13000000','13060000','GWJHIEXVHJBJF','112.4298,39.33105']]
	,[['yunchengshi','ycs','运城市','13000000','13080000','HDWEIIXUVUARJ','110.9912,35.03289']]
	,[['xinzhoushi','xzs','忻州市','13000000','13090000','HBHFJSWVGJVDT','112.73027,38.40761']]
	,[['linfenshi','lfs','临汾市','13000000','13100000','HDCJHGWVBDIBB','111.51899,36.08054'],['linyishi','lys','临沂市','24000000','24130000','HWCGUDXVRBAVT','118.34679,35.05077'],['lingaoxian','lgx','临高县','30000000','30120000','IJCWHHXTFWHET','109.80537,19.93363'],['lincangshi','lcs','临沧市','34000000','34160000','HEFFFDVSUCJGI','100.08757,23.88147'],['linxiahuizuzizhizhou','lxhzzzz','临夏回族自治州','37000000','37130000','GHFWWIXUDTGWB','103.25196,35.53829']]
	,[['lvliangshi','lls','吕梁市','13000000','13110000','HAGDSSXVCUGWA','111.14157,37.52003']]
	,[['huhehaoteshi','hhhts','呼和浩特市','14000000','14010000','GTCIEDWVIRJSI','111.66293,40.81507'],['hulunbeiershi','hlbes','呼伦贝尔市','14000000','14070000','GSRVETWBABUCHH','119.75097,49.21534']]
	,[['baotoushi','bts','包头市','14000000','14020000','GJJTBRWVFRBHD','109.83454,40.65621']]
	,[['wuhaishi','whs','乌海市','14000000','14030000','GGIDUGXUWIHIB','106.82115,39.67102'],['wulanchabushi','wlcbs','乌兰察布市','14000000','14100000','GVVIGHWVRETEV','113.10002,40.44956'],['wulumuqishi','wlmqs','乌鲁木齐市','40000000','40010000','ECUVDCXTIIWGF','87.61379,43.8253']]
	,[['chifengshi','cfs','赤峰市','14000000','14040000','HFATDJXWFWWDI','118.94544,42.27112']]
	,[['tongliaoshi','tls','通辽市','14000000','14050000','HIAVSEXWUBUFJ','122.26398,43.61723'],['tonghuashi','ths','通化市','16000000','16050000','IAISAHXWWUEDI','125.93399,41.72609']]
	,[['eerduosishi','eedss','鄂尔多斯市','14000000','14060000','GSCEHBWVEJIIA','109.9976,39.81488'],['ezhoushi','ezs','鄂州市','26000000','26060000','IAWFGTXUURVVD','114.88127,30.401']]
	,[['xinganmeng','xam','兴安盟','14000000','14080000','HEADFHWBAAIUVR','122.06584,46.06962']]
	,[['xilinguolemeng','xlglm','锡林郭勒盟','14000000','14090000','GVCBEIXWEDACB','116.08588,43.94517']]
	,[['alashanmeng','alsm','阿拉善盟','14000000','14120000','FRDWJIXURDUVF','101.06902,41.95791'],['abaqiangzuzizhizhou','abczqzzzz','阿坝','32000000','32190000','GTWCDHXTSHVSC','102.36364,30.99878'],['alidiqu','aldq','阿里地区','35000000','35060000','FUUVCJWSIEVAR','91.13457,29.65145'],['akesudiqu','aksdq','阿克苏地区','40000000','40080000','ECTRRTUTIIAJH','87.56985,43.83134'],['aletaidiqu','altdq','阿勒泰地区','40000000','40140000','ECSWBCXUBCBVW','90.38296,46.67415'],['alaershi','ales','阿拉尔市','40000000','40170000','DVDESFWSJVFBC','81.28059,40.54743']]
	,[['shenyangshi','sys','沈阳市','15000000','15010000','HTJIVBXWTBVUC','123.42577,41.80385']]
	,[['anshanshi','ass','鞍山市','15000000','15030000','HTWVTTXWRGEAH','122.98945,41.10662']]
	,[['fushunshi','fss','抚顺市','15000000','15040000','HUBGDJXWTSTTT','123.78842,41.84562'],['fuzhoushi','fzs','抚州市','23000000','23100000','IGUSGJVUTECUE','116.34806,28.00222']]
	,[['benxishi','bxs','本溪市','15000000','15050000','HUVDSVXWSUJUF','123.76097,41.29204']]
	,[['dandongshi','dds','丹东市','15000000','15060000','IAJTWAXWSADJB','124.37912,40.12537']]
	,[['jinzhoushi','jzs','锦州市','15000000','15070000','HRCDJSXWHJFER','121.13354,41.12256']]
	,[['yingkoushi','yks','营口市','15000000','15080000','HTICHAXWIIVUJ','122.22972,40.66525']]
	,[['fuxinshi','fxs','阜新市','15000000','15090000','HJJCFJXWJSHWV','121.64739,42.00827'],['fuyangshi','fys','阜阳市','21000000','21110000','HVJGCUXVCWCGG','115.82881,32.90309']]
	,[['liaoyangshi','lys','辽阳市','15000000','15100000','HUARIJXWRVRWI','123.1772,41.26432'],['liaoyuanshi','lys','辽源市','16000000','16040000','HUIVVIWBAAGBVH','125.13727,42.88552']]
	,[['panjinshi','pjs','盘锦市','15000000','15110000','HSIWVFXWIWWHC','122.06339,41.11983']]
	,[['tielingshi','tls','铁岭市','15000000','15120000','HTHUTAXWUHRUU','123.83654,42.28407']]
	,[['chaoyangshi','cys','朝阳市','15000000','15130000','HIGHARXWHDRSH','120.44856,41.57567']]
	,[['huludaoshi','hlds','葫芦岛市','15000000','15140000','HREWBEXWGHVBH','120.83181,40.70954']]
	,[['jilinshi','jls','吉林市','16000000','16020000','HVCVBJWBAEBVVR','126.56601,43.90673'],['jianshi','jas','吉安市','23000000','23080000','IGBGBSXUITWCA','114.96437,27.12363']]
	,[['sipingshi','sps','四平市','16000000','16030000','HSVTGJXWWJIIE','124.34382,43.16342']]
	,[['baishanshi','bss','白山市','16000000','16060000','IAWUCBXBAAVSHT','126.4375,41.9375'],['baichengshi','bcs','白城市','16000000','16080000','HFVAVEWBABBABS','122.84375,45.625'],['baishalizu','bslzzzx','白沙黎族自治县','30000000','30130000','IRBBFFUTEFASG','109.55357,19.10361'],['baiyinshi','bys','白银市','37000000','37040000','GRBWUGXUHDDWB','105.27547,35.7599']]
	,[['songyuanshi','sys','松原市','16000000','16070000','HJRDVSWBADGAFV','124.83452,45.15042']]
	,[['yanbianzizhizhou','ybcxzzzz','延边朝鲜族自治州','16000000','16090000','IEDCFHJBAHBEBG','129.5067,42.9044'],['yananshi','yas','延安市','36000000','36060000','GWEGGCXUVVHBH','109.48628,36.59523']]
	,[['haerbinshi','hebs','哈尔滨市','17000000','17010000','HSHWUDXBAHARIG','126.64452,45.7421'],['hamidiqu','hmdq','哈密地区','40000000','40040000','EUGDHFVUAATUE','93.51548,42.83224']]
	,[['qiqihaershi','qqhes','齐齐哈尔市','17000000','17020000','HEWGJRXBAFGFFH','123.96368,47.34471']]
	,[['jixishi','jxs','鸡西市','17000000','17030000','ICTGRSXBATWDAG','130.96496,45.29366']]
	,[['hegangshi','hgs','鹤岗市','17000000','17040000','HVREATXBAVVGWH','130.24985,47.28862'],['hebishi','hbs','鹤壁市','25000000','25060000','HHGUUJWVFADAE','114.16006,35.9251']]
	,[['shuangyashanshi','syss','双鸭山市','17000000','17050000','IBADECXBAWERIH','131.15452,46.63883']]
	,[['yichunshi','ycs','伊春市','17000000','17070000','HSVGSRXBAUHUFW','128.88932,47.72347'],['yilizizhizhou','ylhskzzz','伊犁哈萨克自治州','40000000','40120000','DJCBGWXSWBJWG','81.32362,43.9166']]
	,[['jiamusishi','jmss','佳木斯市','17000000','17080000','HWIIDTXBAVFCBW','130.35141,46.80602']]
	,[['qitaiheshi','qths','七台河市','17000000','17090000','IBVBJCXBAUJWST','130.89278,45.80798']]
	,[['mudanjiangshi','mdjs','牡丹江市','17000000','17100000','IBTVJCXBAJTWCB','129.61841,44.58224']]
	,[['heiheshi','hhs','黑河市','17000000','17110000','HFVSSSXBAWDCSC','127.48942,50.24292']]
	,[['suihuashi','shs','绥化市','17000000','17120000','HRRIUJXBAIVWBI','126.9896,46.63752']]
	,[['shanghaishi','shs','上海市','0','18000000','IJSRVJXVIWCHC','121.44645,31.21773'],['shangraoshi','srs','上饶市','23000000','23110000','IIRAGFXUWHABR','117.96887,28.46339']]
	,[['nanjingshi','njs','南京市','19000000','19010000','IEGEITWVGCVHF','118.79128,32.06045'],['nantongshi','nts','南通市','19000000','19060000','IHSFJSWVJECVR','120.8873,31.98288'],['nanpingshi','nps','南平市','22000000','22070000','ISSGHCXUTWJGD','118.17282,26.64481'],['nanchangshi','ncs','南昌市','23000000','23010000','IFCEUTVUTJJDU','115.89732,28.67417'],['nanyangshi','nys','南阳市','25000000','25130000','HJGEVGXUVAWHW','112.52618,33.00341'],['nanningshi','nns','南宁市','29000000','29010000','ICJESUVTICRUG','108.36257,22.81909'],['nanchongshi','ncs','南充市','32000000','32110000','HCVSESWUAUSTT','106.07843,30.79913']]
	,[['wuxishi','wxs','无锡市','19000000','19020000','IHHBVAWVHSRRD','120.29849,31.56746']]
	,[['xuzhoushi','xzs','徐州市','19000000','19030000','HVJFUDXVHBGWE','117.18587,34.26105']]
	,[['changzhoushi','czs','常州市','19000000','19040000','IGJFJWXVHIHDA','119.95071,31.78353'],['changdeshi','cds','常德市','27000000','27070000','HVDAVWXUGSCRI','111.68547,29.01893']]
	,[['suzhoushi','szs','苏州市','19000000','19050000','IIFEWRXVHTWVS','120.61642,31.30401']]
	,[['lianyungangshi','lygs','连云港市','19000000','19070000','IBBRSJWVRREAV','119.17499,34.59923']]
	,[['huaianshi','has','淮安市','19000000','19080000','ICGJGDWVIVFJA','119.03185,33.59935'],['huainanshi','hns','淮南市','21000000','21040000','IASFHWXVEDVTE','116.94969,32.63307'],['huaibeishi','hbs','淮北市','21000000','21060000','HVHEGJXVFWWCI','116.78496,33.94568']]
	,[['yanchengshi','ycs','盐城市','19000000','19090000','IEGSSTXVRDWJB','120.1331,33.38387']]
	,[['yangzhoushi','yzs','扬州市','19000000','19100000','IEUWEUXVHRSJG','119.43625,32.39117']]
	,[['zhenjiangshi','zjs','镇江市','19000000','19110000','IFCRFFWVHGGAI','119.44326,32.2061']]
	,[['taizhoushi','tzs','泰州市','19000000','19120000','IFGWVFXVIIUDV','119.91017,32.49493'],['taianshi','tas','泰安市','24000000','24090000','HSIVBAXVJWASD','117.12697,36.1881']]
	,[['suqianshi','xqs','宿迁市','19000000','19130000','IASVJUWVIFASV','118.29509,33.95513'],['suzhoushi','xzs','宿州市','21000000','21120000','HWDSDFXVFUGHA','116.9873,33.6391']]
	,[['hangzhoushi','hzs','杭州市','20000000','20010000','IJDATIWVFIIBH','120.15047,30.27536']]
	,[['ningboshi','nbs','宁波市','20000000','20020000','ISVUHUWVHAUFE','121.5456,29.87668'],['ningdeshi','nds','宁德市','22000000','22090000','IUTHDHXUWBCGA','119.53699,26.65533']]
	,[['wenzhoushi','wzs','温州市','20000000','20030000','IUHWCDXVCVDGR','120.69534,27.9982']]
	,[['jiaxingshi','jxs','嘉兴市','20000000','20040000','IJFTGAWVHDDBJ','120.75284,30.76613'],['jiayuguanshi','jygs','嘉峪关市','37000000','37020000','FJEGJHWUCRVGI','98.27287,39.79921']]
	,[['huzhoushi','hzs','湖州市','20000000','20050000','IIDDFUWVGFRTV','120.09581,30.86945']]
	,[['shaoxingshi','sxs','绍兴市','20000000','20060000','IREBUTXVFTERW','120.57757,30.00338']]
	,[['jinhuashi','jhs','金华市','20000000','20070000','IRDGFTXVCWSAH','119.64937,29.10462'],['jinchangshi','jcs','金昌市','37000000','37030000','GAWHSFXUFUSCV','101.83369,38.31909']]
	,[['quzhoushi','qzs','衢州市','20000000','20080000','IJEDARWVBJCGD','118.8763,28.95445']]
	,[['zhoushanshi','zss','舟山市','20000000','20090000','ITIHABXVIDIWA','122.1256,30.06368']]
	,[['taizhoushi','tzs','台州市','20000000','20100000','IUJHGTWVFADDF','121.42248,28.66317']]
	,[['lishuishi','lss','丽水市','20000000','20110000','ISRHIDWVCGJFI','119.93541,28.44563'],['lijiangshi','ljs','丽江市','34000000','34060000','GWWHFRXTBWCCW','100.22428,26.88019']]
	,[['hefeishi','hfs','合肥市','21000000','21010000','ICGCIJWVDJFGT','117.2821,31.86714']]
	,[['wuhushi','whs','芜湖市','21000000','21020000','IEUISRWVEGSBF','118.36223,31.33398']]
	,[['bengbushi','bbs','蚌埠市','21000000','21030000','IAUUAAWVFFCHB','117.35312,32.93537']]
	,[['maanshanshi','mass','马鞍山市','21000000','21050000','IEHRWSXVFDABT','118.49443,31.70617']]
	,[['tonglingshi','tls','铜陵市','21000000','21070000','IEJTFVWVCVFJF','117.78641,30.91268'],['tongchuanshi','tcs','铜川市','36000000','36020000','HBAIDHVUSHRUC','108.94044,34.89782'],['tongrendiqu','trdq','铜仁地区','33000000','33100000','HTFVTIWUAVFID','109.18781,27.71462']]
	,[['anqingshi','aqs','安庆市','21000000','21080000','IEBEABWVBDAAR','117.05181,30.52717'],['anyangshi','ays','安阳市','25000000','25050000','HHHDVVXVFIVEW','114.34614,36.09561'],['anshunshi','ass','安顺市','33000000','33040000','HJRFJIUTJSARS','105.93401,26.24562'],['ankangshi','aks','安康市','36000000','36090000','HEIHWSXUIDSWG','109.02352,32.68774']]
	,[['huangshanshi','hss','黄山市','21000000','21090000','IHDTICWVBUURU','118.30895,29.71454'],['huangshi','hss','黄石市','26000000','26020000','IBHVFUWUUJTDA','115.03262,30.20178'],['huanggangshi','hgs','黄冈市','26000000','26100000','IAVEGFWUUTFTT','114.8888,30.45212'],['huangnanzangzuzizhizhou','hnczzzz','黄南藏族自治州','38000000','38040000','GFIHSWXUBUTDE','102.01937,35.51459']]
	,[['chuzhoushi','czs','滁州市','21000000','21100000','IDEJCAWVFUDAJ','118.31148,32.30621']]
	,[]
	,[['liuanshi','las','六安市','21000000','21140000','IBFVUSXVCDSWT','116.50755,31.75737'],['liupanshuishi','lpss','六盘水市','33000000','33020000','HHHUGFVTIJBGG','104.85949,26.58473']]
	,[['bozhoushi','bzs','亳州市','21000000','21150000','HUAIWVXVEFIFU','115.77861,33.86968']]
	,[['chizhoushi','czs','池州市','21000000','21160000','IEIGTWXVCAUIC','117.48224,30.6637']]
	,[['xuanchengshi','xcs','宣城市','21000000','21170000','IGAREWXVEGSDE','118.75353,30.94299']]
	,[['fuzhoushi','fzs','福州市','22000000','22010000','IVEJETWUUUASU','119.2918,26.07713']]
	,[['xiamenshi','xms','厦门市','22000000','22020000','IVVJBBWUJJGJI','118.11116,24.48748']]
	,[['putianshi','pts','莆田市','22000000','22030000','IVUDRUWUTGIEV','119.00757,25.43865']]
	,[['sanmingshi','sms','三明市','22000000','22040000','ISHCWSXUSIFFT','117.61027,26.25497'],['sanmenxiashi','smxs','三门峡市','25000000','25120000','HERHERWUVSTUF','111.19463,34.7787'],['sanyashi','sys','三亚市','30000000','30020000','ISESAGXTCWCTB','109.50715,18.25414']]
	,[['quanzhoushi','qzs','泉州市','22000000','22050000','IVWVHJXURWGTT','118.58938,24.9109']]
	,[['zhangzhoushi','zzs','漳州市','22000000','22060000','IVCTCHWUIVUGC','117.65276,24.5127']]
	,[['longyanshi','lys','龙岩市','22000000','22080000','ITFETFWUIUVJR','117.03047,25.09715']]
	,[['jingdezhenshi','jdzs','景德镇市','23000000','23020000','IGDEDJXUWIJUI','117.208,29.29016']]
	,[['pingxiangshi','pxs','萍乡市','23000000','23030000','IDJUIJVUHUTGA','113.84396,27.6226']]
	,[['jiujiangshi','jjs','九江市','23000000','23040000','IDTAGCWUVFTBB','116.01809,29.70752']]
	,[['xinyushi','xys','新余市','23000000','23050000','IEWTJDXUJTWJR','114.9323,27.81228'],['xinxiangshi','xxs','新乡市','25000000','25070000','HHWEWDXVDJSIC','113.87282,35.292']]
	,[['yingtanshi','yts','鹰潭市','23000000','23060000','IHIGSDXUURWRT','117.03431,28.24997']]
	,[['ganzhoushi','gzs','赣州市','23000000','23070000','IHWJHHXUGUEVV','114.93514,25.857']]
	,[['yichunshi','ycs','宜春市','23000000','23090000','IECIHHWUIVVEV','114.37242,27.7954'],['yichangshi','ycs','宜昌市','26000000','26040000','HSATBHVUISGJI','111.31567,30.70953'],['yibinshi','ybs','宜宾市','32000000','32130000','HDUGBFVTSIUDG','104.63997,28.75961']]
	,[['jinanshi','jns','济南市','24000000','24010000','HRJVAAWVRHFFU','116.9895,36.66519'],['jiningshi','jns','济宁市','24000000','24080000','HSVHDJWVHVUUR','116.58209,35.41497'],['jiyuanshi','jys','济源市','25000000','25180000','HGEJDIZVBFESF','112.57934,35.09351']]
	,[['qingdaoshi','qds','青岛市','24000000','24020000','IASDGIWVVSGIU','120.37714,36.06587']]
	,[['ziboshi','zbs','淄博市','24000000','24030000','HTAVDJWVTEHVC','118.05797,36.79101']]
	,[['zaozhuangshi','zzs','枣庄市','24000000','24040000','HVDUUEWVIIUTH','117.55301,34.85346']]
	,[['dongyingshi','dys','东营市','24000000','24050000','HSUERIWVVBGCU','118.57602,37.45643'],['dongguanshi','dgs','东莞市','28000000','28170000','IRHDSEVUASTDU','113.74928,23.04749'],['dongfangshi','dfs','东方市','30000000','30080000','IIRWUUXTCVTIA','108.64518,19.1001']]
	,[['yantaishi','yts','烟台市','24000000','24060000','HWWUHDXWCHRJC','121.37818,37.53272']]
	,[['weifangshi','wfs','潍坊市','24000000','24070000','HUTJUUWVUSVIC','119.10535,36.70267']]
	,[['weihaishi','whs','威海市','24000000','24100000','IBCERRXWDJCCD','122.1139,37.51269']]
	,[['rizhaoshi','rzs','日照市','24000000','24110000','IAFTHRWVTFJJS','119.49154,35.40281'],['rikazediqu','rkzdq','日喀则地区','35000000','35040000','FFUJAJVSCBCHR','86.46425,30.23713']]
	,[['laiwushi','lws','莱芜市','24000000','24120000','HTFICSXVRTHWC','117.66118,36.20492']]
	,[['dezhoushi','dzs','德州市','24000000','24140000','HIEVBTWVRSSVF','116.32216,37.51309'],['deyangshi','dys','德阳市','32000000','32050000','GWUIVAXTVTSAH','104.39499,31.12892'],['dehongzizhizhou','dhdzjpzzzz','德宏傣族景颇族自治州','34000000','34130000','HBDBVWXSSSGUC','98.58488,24.43546']]
	,[['liaochengshi','lcs','聊城市','24000000','24150000','HJFDFSWVIJVDI','115.96321,36.48535']]
	,[['binzhoushi','bzs','滨州市','24000000','24160000','HSAWCDXVUBRBV','118.00056,37.38662']]
	,[['hezeshi','hzs','菏泽市','24000000','24170000','HRHRJJXVFWWUG','115.48303,35.24935']]
	,[['zhengzhoushi','zzs','郑州市','25000000','25010000','HIGSCCWVCHAHF','113.64131,34.75794']]
	,[['kaifengshi','kfs','开封市','25000000','25020000','HJGVEGXVDIWGW','114.34034,34.79357']]
	,[['luoyangshi','lys','洛阳市','25000000','25030000','HGTWWBXVAGHFV','112.44799,34.61727']]
	,[['pingdingshanshi','pdss','平顶山市','25000000','25040000','HJHARHWVAFTSR','113.29544,33.74258'],['pingliangshi','pls','平凉市','37000000','37080000','GUATRJVUITGUG','106.74967,35.31711']]
	,[['jiaozuoshi','jzs','焦作市','25000000','25080000','HHBCJJXVCIHWI','113.2304,35.22904']]
	,[['puyangshi','pys','濮阳市','25000000','25090000','HJATJEWVGBSDJ','115.04958,35.75291']]
	,[['xuchangshi','xcs','许昌市','25000000','25100000','HJTUEIWVBJITU','113.81858,34.02859']]
	,[['luoheshi','lhs','漯河市','25000000','25110000','HRTGHIWVBDFUU','114.0109,33.58299']]
	,[['shangqiushi','sqs','商丘市','25000000','25140000','HSWBAEXVEWSCS','115.62863,34.43644'],['shangluoshi','sls','商洛市','36000000','36100000','HECAUSVUSGTDC','109.9363,33.86452']]
	,[['xinyangshi','xys','信阳市','25000000','25150000','HUBFDBXUWBFVV','114.07079,32.13063']]
	,[['zhoukoushi','zks','周口市','25000000','25160000','HSRTHWXVCDTSR','114.6418,33.62502']]
	,[['zhumadianshi','zmds','驻马店市','25000000','25170000','HSSISAWVAEVVB','114.02528,32.97729']]
	,[['wuhanshi','whs','武汉市','26000000','26010000','HWTARHXUUAIWI','114.27367,30.58385'],['wuweishi','wws','武威市','37000000','37060000','GDIUECVUGJIIH','102.92284,37.71467']]
	,[['shiyanshi','sys','十堰市','26000000','26030000','HHEGSCXURTGGW','110.7556,32.62087']]
	,[['xiangfanshi','xfs','襄樊市','26000000','26050000','HRDVUGWUTBDJS','112.15504,32.07435']]
	,[['jingmenshi','jms','荆门市','26000000','26070000','HSVJRCWURJETS','112.21134,31.03805'],['jingzhoushi','jzs','荆州市','26000000','26090000','HUARAVWUJIHSU','112.23613,30.32448']]
	,[['xiaoganshi','xgs','孝感市','26000000','26080000','HVRTTVWUUABHD','113.91096,30.92731']]
	,[['xianningshi','xns','咸宁市','26000000','26110000','IAWSBAXUSWJRF','114.32882,29.83411'],['xianyangshi','xys','咸阳市','36000000','36040000','HBIJRTVUREBED','108.70479,34.33076']]
	,[['suizhoushi','szs','随州市','26000000','26120000','HTRADCXUUGCVW','113.36424,31.72359']]
	,[['enshi','estjzmzzzz','恩施土家族苗族自治州','26000000','26130000','HIVFGDWUFEDGA','109.48025,30.28391']]
	,[['xiantaoshi','xts','仙桃市','26000000','26140000','HVTWEFXUSGVDC','113.43891,30.36703']]
	,[['qianjiangshi','qjs','潜江市','26000000','26150000','HUTUJWXURUAEC','112.90696,30.49466']]
	,[['zhuzhoushi','zzs','株洲市','27000000','27020000','ICDADVXUHCBWH','113.13778,27.85157']]
	,[['xiangtanshi','xts','湘潭市','27000000','27030000','IBUTBWXUGTIBI','112.91507,27.84421'],['xiangxizizhizhou','xxtjzmzzzz','湘西土家族苗族自治州','27000000','27140000','HTESRDVUCRFHC','109.73666,28.31248']]
	,[['shaoyangshi','sys','邵阳市','27000000','27050000','IAJDWAXUDRJDW','111.47247,27.24176']]
	,[['yueyangshi','yys','岳阳市','27000000','27060000','HWURCEXUJHAEH','113.12781,29.37274']]
	,[['yiyangshi','yys','益阳市','27000000','27090000','HWVBGTXUHAUAB','112.3547,28.58099']]
	,[['chenzhoushi','czs','郴州市','27000000','27100000','IFCBUEVUDUGGU','113.02264,25.80725']]
	,[['yongzhoushi','yzs','永州市','27000000','27110000','ICFFDFVUCFEIT','111.61144,26.2306']]
	,[['huaihuashi','hhs','怀化市','27000000','27120000','HUUAJHVUBUGUR','109.97008,27.55018']]
	,[['loudishi','lds','娄底市','27000000','27130000','IAJWDWXUFDIAV','111.99742,27.73776']]
	,[['guangzhoushi','gzs','广州市','28000000','28010000','IJJDGAXUABUIW','113.25903,23.13152'],['guangyuanshi','gys','广元市','32000000','32070000','HAAIBIXUCWGSS','105.82209,32.43514'],['guanganshi','gas','广安市','32000000','32140000','HEEGTJVUBDGJR','106.63945,30.47057']]
	,[['shaoguanshi','sgs','韶关市','28000000','28020000','IHIJCWXUDDDST','113.60205,24.81135']]
	,[['shenzhenshi','szs','深圳市','28000000','28030000','ISSGSEVUAHSIH','114.07989,22.55122']]
	,[['zhuhaishi','zhs','珠海市','28000000','28040000','ISFTBFXTWEIUG','113.57133,22.27465']]
	,[['shantoushi','sts','汕头市','28000000','28050000','IVHBSGXUFSBTW','116.6825,23.36437'],['shanweishi','sws','汕尾市','28000000','28130000','IUFBIWXUCTDFT','115.35309,22.77263']]
	,[['foshanshi','fss','佛山市','28000000','28060000','IJHTDHXTWSGTT','113.09785,23.02963']]
	,[['jiangmenshi','jms','江门市','28000000','28070000','IRCSTCXTWBEAW','113.11424,22.59663']]
	,[['zhanjiangshi','zjs','湛江市','28000000','28080000','IHWRVIXTIUJEB','110.355,21.27317']]
	,[['maomingshi','mms','茂名市','28000000','28090000','IICVSCXTRDWRD','110.88002,21.66561']]
	,[['zhaoqingshi','zqs','肇庆市','28000000','28100000','IIHDAVWTVUETJ','112.46915,23.07974']]
	,[['huizhoushi','hzs','惠州市','28000000','28110000','ISGGRHVUBTSBE','114.40693,23.08319']]
	,[['meizhoushi','mzs','梅州市','28000000','28120000','ITCCETVUGDGIS','116.09539,24.29128']]
	,[['heyuanshi','hys','河源市','28000000','28140000','IRUDSGVUDDIRH','114.68678,23.73921'],['hechishi','hcs','河池市','29000000','29120000','HWDWJUXTRJCFE','108.0584,24.69892']]
	,[['qingyuanshi','qys','清远市','28000000','28160000','IIGRBSVUAREBT','113.05075,23.68425']]
	,[['zhongshanshi','zss','中山市','28000000','28180000','IRRTRJXTWFUSG','113.37351,22.52591'],['zhongweishi','zws','中卫市','39000000','39050000','GIBFWTXURHDCJ','105.67146,37.49183']]
	,[['chaozhoushi','czs','潮州市','28000000','28190000','IUVFHTWUGATBU','116.6186,23.65945']]
	,[['jieyangshi','jys','揭阳市','28000000','28200000','IURJHGVUFHRSU','116.35569,23.5502']]
	,[['yunfushi','yfs','云浮市','28000000','28210000','IIASCRWTUVSES','112.0373,22.91385']]
	,[['liuzhoushi','lzs','柳州市','29000000','29020000','IBVATEWTTBBTS','109.41087,24.32812']]
	,[['guilinshi','gls','桂林市','29000000','29030000','IBTDWSXTVUJWG','110.2856,25.27654']]
	,[['wuzhoushi','wzs','梧州市','29000000','29040000','IGAVVHWTURICV','111.30082,23.47852']]
	,[['fangchenggangshi','fcgs','防城港市','29000000','29060000','IEGCDDUTGETBA','108.34041,21.61559']]
	,[['qinzhoushi','qzs','钦州市','29000000','29070000','IEEGFDWTHECVG','108.62068,21.96722']]
	,[['guigangshi','ggs','贵港市','29000000','29080000','IEAUBJWTRHJFV','109.60019,23.09323'],['guiyangshi','gys','贵阳市','33000000','33010000','HRFBHUVTSGBFI','106.70786,26.57942']]
	,[['yulinshi','yls','玉林市','29000000','29090000','IFJTJCUTRJRJH','110.15404,22.62443'],['yuxishi','yxs','玉溪市','34000000','34030000','HHFUSFXTBJWHG','102.54317,24.34953'],['yushuzangzuzizhizhou','ysczzzz','玉树藏族自治州','38000000','38070000','FTGESRUTBTCEF','93.74935,33.23246']]
	,[['baiseshi','bss','百色市','29000000','29100000','HVEDUGXTHCFWW','106.61442,23.89949']]
	,[['hezhoushi','hzs','贺州市','29000000','29110000','IFAAHEXTWHGIU','111.54648,24.41653']]
	,[['laibinshi','lbs','来宾市','29000000','29130000','ICICDUWTRVDHE','109.23056,23.73444']]
	,[['chongzuoshi','czs','崇左市','29000000','29140000','IBSIUJXTFWTII','107.36648,22.38592']]
	,[['haikoushi','hks','海口市','30000000','30010000','IJUDBBWTGVIUT','110.32398,20.03342'],['haidongdiqu','hddq','海东地区','38000000','38020000','GECHSAVUDIDHH','102.11051,36.507'],['haibeizangzuzizhizhou','hbczzzz','海北藏族自治州','38000000','38030000','FVTCREWUDDJJD','100.24819,38.18016'],['hainanzangzuzizhizhou','hnczzzz','海南藏族自治州','38000000','38050000','GFAIDTXTWCEFJ','100.96546,34.78711'],['haiximengguzuzangzuzizhizhou','hxmgzczzzz','海西蒙古族藏族自治州','38000000','38080000','FTAIBJWTRVGVA','96.62676,36.347']]
	,[['wuzhishanshi','wzss','五指山市','30000000','30030000','IRICISUTDTCCC','109.51598,18.7762'],['wujiaqushi','wjqs','五家渠市','40000000','40160000','ECDHCJWTIVUUR','87.52089,44.16001']]
	,[['qionghaishi','qhs','琼海市','30000000','30040000','ISDSGDWTFVTDR','110.46182,19.24884'],['qiongzhonglizu','qzlzmzzzx','琼中黎族苗族自治县','30000000','30180000','ISFERAUTESCIH','110.09259,18.815']]
	,[['danzhoushi','dzs','儋州市','30000000','30050000','IIRSHRUTEAFBF','108.99871,19.46486']]
	,[['wenchangshi','wcs','文昌市','30000000','30060000','ISESAAXTGWABJ','110.81444,19.56149'],['wenshanzhuangzumiaozuzizhizhou','wszzmzzzz','文山壮族苗族自治州','34000000','34090000','HUIFRHWTERVDI','105.56231,23.33425']]
	,[['wanningshi','wns','万宁市','30000000','30070000','ISJHVWXTFRUDV','110.49966,19.04976']]
	,[['dinganxian','dax','定安县','30000000','30090000','IRTVUIWTFTBGU','110.2681,19.33299'],['dingxishi','dxs','定西市','37000000','37110000','GIVEUTWUFFCUH','104.25649,35.54726']]
	,[['tunchangxian','tcx','屯昌县','30000000','30100000','IRHWEFXTFIUWC','110.10035,19.36895']]
	,[['chengmaixian','cmx','澄迈县','30000000','30110000','IRACCTVTGCRUH','110.14105,19.7299']]
	,[['changjianglizu','cjlzzzx','昌江黎族自治县','30000000','30140000','IITGHRUTDHTGB','108.85829,19.25532'],['changdudiqu','cddq','昌都地区','35000000','35020000','GEJTEAXTEBWBU','97.21606,31.31415'],['changjizizhizhou','cjhzzzz','昌吉回族自治州','40000000','40050000','ECCBCUWTIFSVR','87.30595,44.00135']]
	,[['ledonglizu','ldlzzzx','乐东黎族自治县','30000000','30150000','IRAIGAWTCFHVF','108.89594,18.46891'],['leshanshi','lss','乐山市','32000000','32100000','HBEBFWXTSGWFC','103.756,29.56706']]
	,[['lingshuilizu','lslzzzx','陵水黎族自治县','30000000','30160000','ISTCTDWTEFEAV','110.11264,18.5531']]
	,[['chongqingshi','cqs','重庆市','0','31000000','HFISFCXTWJRFB','106.52713,29.52744']]
	,[['chengdushi','cds','成都市','32000000','32010000','HAAUTSVTUJCFE','104.06247,30.66093']]
	,[['zigongshi','zgs','自贡市','32000000','32020000','HDCHREUTTRFRF','104.77564,29.34185']]
	,[['panzhihuashi','pzhs','攀枝花市','32000000','32030000','HCRHCWXTDSAST','101.67629,26.57135']]
	,[['luzhoushi','lzs','泸州市','32000000','32040000','HEUSFAXTTWJSS','105.44093,28.89182']]
	,[['mianyangshi','mys','绵阳市','32000000','32060000','GWUSAIXTWUFDH','104.73847,31.46688']]
	,[['suiningshi','sns','遂宁市','32000000','32080000','HCJJUFXTWRIGC','105.58067,30.50991']]
	,[['neijiangshi','njs','内江市','32000000','32090000','HDDDRIXTUGWRS','105.04961,29.58506']]
	,[['meishanshi','mss','眉山市','32000000','32120000','HAJUAIVTTFRFF','103.84646,30.07823']]
	,[['dazhoushi','dzs','达州市','32000000','32150000','HEGUGBXUDJWFE','107.47826,31.21058']]
	,[['yaanshi','yas','雅安市','32000000','32160000','GWHHIFXTRVTBA','103.00194,29.9851']]
	,[['bazhongshi','bzs','巴中市','32000000','32170000','HCFGGWXUDIBVG','106.75586,31.85764'],['bayinguolezizhizhou','byglmgzzz','巴音郭楞蒙古自治州','40000000','40070000','EDTHJAUTDCSHF','86.14618,41.76027'],['bayannaoershi','bynes','巴彦淖尔市','14000000','14110000','GFSSFDWVCBBBI','107.39597,40.75915']]
	,[['ziyangshi','zys','资阳市','32000000','32180000','HBTAGFVTURCSI','104.63974,30.12562']]
	,[['ganzizangzuzizhizhou','gzczzzz','甘孜','32000000','32200000','GTGIGRXTRJHAW','101.89076,30.87867'],['gannanzangzuzizhizhou','gnczzzz','甘南藏族自治州','37000000','37140000','GJAJGEWUDSUVJ','103.78494,34.98219']]
	,[['liangshanlizuzizhizhou','lsyzzzz','凉山','32000000','32210000','HBBJHHWTESSVG','101.50918,27.4224']]
	,[['zunyishi','zys','遵义市','33000000','33030000','HIWCRAXTUGIRU','106.9235,27.69327']]
	,[['qianxinanbuyizumiaozuzizhizhou','qxnbyzmzzzz','黔西南布依族苗族自治州','33000000','33060000','HRCSHRXTHTWBD','105.48894,25.45781'],['qiandongnanmiaozudongzuzizhizhou','qdnmzdzzzz','黔东南苗族侗族自治州','33000000','33080000','HTDWUAXTUFCTB','107.97728,26.58337'],['qiannanbuyizumiaozuzizhizhou','qnbyzmzzzz','黔南布依族苗族自治州','33000000','33090000','HTGAECUTTFIJB','107.69857,26.2216']]
	,[['bijiediqu','bjdq','毕节地区','33000000','33070000','HHAGVRXTRFBBW','105.28092,27.30947']]
	,[['kunmingshi','kms','昆明市','34000000','34010000','HGIVRBXTCWBDG','102.71043,25.04691']]
	,[['qujingshi','qjs','曲靖市','34000000','34020000','HHIEFUVTFESHI','103.79586,25.50326']]
	,[['zhaotongshi','zts','昭通市','34000000','34050000','HEJJVCXTHWGFJ','103.71445,27.33284']]
	,[['chuxiongzizhizhou','cxyzzzz','楚雄彝族自治州','34000000','34070000','HETSVRWTBCGHU','101.54635,25.03666']]
	,[['honghezizhizhou','hhhnzyzzzz','红河哈尼族彝族自治州','34000000','34080000','HJTHJUVTBBDRC','103.15511,23.37963']]
	,[['puershi','pes','普洱市','34000000','34100000','HHFUJHVSTUGJT','100.97521,22.78187']]
	,[['xushuangbannazizhizhou','xsbndzzzz','西双版纳傣族自治州','34000000','34110000','HIFGDITSSDRAH','100.76535,21.93552'],['xianshi','xas','西安市','36000000','36010000','HBWVHUXURIDUI','108.93954,34.26646'],['xiningshi','xns','西宁市','38000000','38010000','GDIATWXUDCTBA','101.78503,36.60873']]
	,[['nujiangzizhizhou','njlszzzz','怒江傈僳族自治州','34000000','34140000','GWHEFFXSVEJIR','98.85767,25.84899']]
	,[['diqingzizhizhou','dqczzzz','迪庆藏族自治州','34000000','34150000','GUSSBDVTCJJAT','99.70535,27.82629']]
	,[['lasashi','lss','拉萨市','35000000','35010000','FUUVCJWSIEVAR','91.13457,29.65145']]
	,[['shannandiqu','sndq','山南地区','35000000','35030000','GAUUJGXSJSWBU','92.58929,29.14156']]
	,[['naqudiqu','nqdq','那曲地区','35000000','35050000','FIHWJEXSGRTDB','88.84026,30.87607']]
	,[['linzhidiqu','lzdq','林芝地区','35000000','35070000','GBGEJCXSJWBJF','92.82667,29.03338']]
	,[['baojishi','bjs','宝鸡市','36000000','36030000','GWDDUEXUIADTU','107.20552,34.36197']]
	,[['weinanshi','wns','渭南市','36000000','36050000','HCHWJSXUSSSTR','109.5041,34.50048']]
	,[['hanzhongshi','hzs','汉中市','36000000','36070000','HAVCSFWUFTIRI','107.02598,33.07938']]
	,[['yulinshi','yls','榆林市','36000000','36080000','GUBASHWVBUJHE','109.72781,38.28487']]
	,[['lanzhoushi','lzs','兰州市','37000000','37010000','GHHFWWXUFHFVE','103.83177,36.06171']]
	,[['jiuquanshi','jqs','酒泉市','37000000','37090000','FJSRCIXUCWGEW','98.51283,39.74332']]
	,[['qingyangshi','qys','庆阳市','37000000','37100000','GUACGTVURRDCJ','107.34626,35.93991']]
	,[['longnanshi','lns','陇南市','37000000','37120000','GUEDUVXUCWCTJ','104.91051,33.33662']]
	,[['guoluozangzuzizhizhou','glczzzz','果洛藏族自治州','38000000','38060000','GFWVHGXTSUCVW','100.19338,33.38469']]
	,[['yinchuanshi','ycs','银川市','39000000','39010000','GHIDEDWUTUJVV','106.27056,38.46654']]
	,[['wuzhongshi','wzs','吴忠市','39000000','39030000','GHVGSBXUSUWDT','106.07694,38.01838']]
	,[['guyuanshi','gys','固原市','39000000','39040000','GSEGWRXUJBGBB','106.27037,35.99924']]
	,[['kelamayishi','klmys','克拉玛依市','40000000','40020000','DSWSFGXTHBGBW','84.87442,45.59885'],['kezilesukeerkezizizhizhou','kzlskekzzzz','克孜勒苏柯尔克孜自治州','40000000','40090000','DHRTUJVSAUCTG','76.16807,39.71487']]
	,[['tulufandiqu','tlfdq','吐鲁番地区','40000000','40030000','EGJJHVXTJJSAW','89.17918,42.94513']]
	,[['boertazizhizhou','betlmgzzz','博尔塔拉蒙古自治州','40000000','40060000','DITEADWTBTBVE','82.07435,44.90649']]
	,[['kashendiqu','ksdq','喀什地区','40000000','40100000','DHTHFUVSACTIT','75.98924,39.46816']]
	,[['hetiandiqu','htdq','和田地区','40000000','40110000','EEJSJJUSCJTFR','80.99153,36.06281']]
	,[['tachengdiqu','tcdq','塔城地区','40000000','40130000','DIRDBBXTGJWFR','83.62637,46.54285']]
	,[['tumushukeshi','tmsks','图木舒克市','40000000','40180000','DSVCUTWSFIBTU','79.08268,39.86977']]
	,[['geermu','gem','格尔木市','38000000','38090000','FJFDDUVTIFTAE','94.9068,36.40076']]
	,[['xianggangshi','xgs','香港市','85200000','85200000','ITDEADZUAEEVV','14.1704,22.32094']]
	,[['aomentebiexingzhengqu','amtbxzq','澳门特别行政区','41020000','41020000','ISFUGBXTWAWUA','113.50000,22.20000']]
];

//公交城市  
var arBusCity = new Array();
arBusCity = [
'北京市','上海市','天津市','重庆市','合肥市','滁州市','淮南市','阜阳市','马鞍山市','芜湖市'
,'淮北市','池州市','铜陵市','宿州市','黄山市','六安市','宣城市','蚌埠市'
,'安庆市','福州市','南平市','三明市','泉州市','漳州市','宁德市','莆田市','厦门市','龙岩市'
,'兰州市','天水市','广州市','惠州市','珠海市','中山市','江门市','深圳市','汕头市','佛山市'
,'东莞市','河源市','梅州市','韶关市','潮州市','肇庆市','茂名市','揭阳市','南宁市','梧州市'
,'桂林市','北海市','百色市','贵阳市','海口市','三亚市','石家庄市','保定市','廊坊市','秦皇岛市'
,'邯郸市','邢台市','张家口市','承德市','唐山市','衡水市','沧州市','郑州市','济源市','新乡市'
,'焦作市','洛阳市','开封市','安阳市','许昌市','鹤壁市','三门峡市','商丘市','哈尔滨市','大庆市'
,'鹤岗市','牡丹江市','伊春市','佳木斯市','齐齐哈尔市','武汉市','宜昌市','襄樊市','长沙市','怀化市'
,'益阳市','郴州市','衡阳市','株洲市','岳阳市','湘潭市','长春市','白山市','吉林市','延边朝鲜族自治州'
,'四平市','辽源市','白城市','通化市','南京市','苏州市','淮安市','常州市','徐州市','无锡市'
,'南通市','泰州市','镇江市','盐城市','连云港市','扬州市','南昌市','赣州市','沈阳市','大连市','铁岭市','朝阳市'
,'丹东市','鞍山市','葫芦岛市','本溪市','锦州市','营口市','抚顺市','呼和浩特市','包头市','赤峰市'
,'通辽市','鄂尔多斯市','银川市','西宁市','日照市','青岛市','临沂市','潍坊市','烟台市','济宁市'
,'济南市','威海市','东营市','淄博市','泰安市','聊城市','太原市','朔州市','吕梁市','阳泉市'
,'长治市','运城市','西安市','咸阳市','宝鸡市','铜川市','渭南市','榆林市','延安市','汉中市'
,'安康市','商洛市','成都市','绵阳市','德阳市','攀枝花市','拉萨市','乌鲁木齐市','昌吉','和田'
,'昆明市','杭州市','温州市','金华市','台州市','湖州市','绍兴市','衢州市','嘉兴市','宁波市','宿迁市'
,'舟山市','丽水市','菏泽市','德州市','滨州市','莱芜市','枣庄市','达州市','广安市','广元市','南充市'
,'遂宁市','内江市','乐山市','自贡市','泸州市','宜宾市','巴中市','资阳市','眉山市','雅安市','凉山','平顶山市'
,'驻马店市','亳州市','娄底市','大理白族自治州','丽江市','九江市','赣州市','陇南市','金昌市','吉安市','景德镇市','上饶市','新余市','宜春市','鹰潭市'
,'萍乡市','抚州市','甘南藏族自治州','武威市','白银市','嘉峪关市','平凉市','张掖市','香港市','信阳市','南阳市','定西市','酒泉市','临夏回族自治州'
,'贺州市','柳州市','玉林市','大兴安岭地区','绥化市','黑河市','鸡西市','七台河市','来宾市','河池市','克拉玛依市','忻州市','大同市','晋中市','晋城市'
,'贵港市','钦州市','临汾市','防城港市','崇左市','凉山市','澳门特别行政区'
];

//  甘南藏族自治州       大理白族自治州   延边朝鲜族自治州    临夏回族自治州

//根据城市名称判断是否支持公交
function isCityHaveBusInfo(strCityName)
{
	if( typeof strCityName == "undefined" || strCityName == null || strCityName.length < 1 ) return false;
	var i = 0;
	for( i = 0 ; i < arBusCity.length ; i ++)
	{
		if( trim(strCityName) == arBusCity[i] ) return true;
	}
	return false;
}
//自动匹配  "市"
function isCityHaveBusInfoShi(strCityName)
{
	if( typeof strCityName == "undefined" || strCityName == null || strCityName.length < 1 ) return false;
	var i = 0;
	for( i = 0 ; i < arBusCity.length ; i ++)
	{   
	  if(arBusCity[i].substring(arBusCity[i].length-1,arBusCity[i].length)=="市")	{
		if(trim(strCityName) == arBusCity[i]|| trim(strCityName)==arBusCity[i].substring(0,arBusCity[i].length-1) ) return true;
	  }
	  if(arBusCity[i].substring(arBusCity[i].length-3,arBusCity[i].length)=="自治州"){
		  if(trim(strCityName) == arBusCity[i]|| trim(strCityName)==arBusCity[i].substring(0,2) ) return true;
	  }
	   if(arBusCity[i].substring(arBusCity[i].length-3,arBusCity[i].length)=="行政区"){
		  if(trim(strCityName) == arBusCity[i]|| trim(strCityName)==arBusCity[i].substring(0,2) ) return true;
	  }
	}
	return false;
}
//省下所有市的内容
var arShengCity = new Array();
arShengCity = [
['100','北京市']
,['8520','香港市']
,['8530','澳门特别行政区']	
,['311','河北省','石家庄市','唐山市','秦皇岛市','邯郸市','邢台市','保定市','张家口市','承德市','沧州市','廊坊市','衡水市']
,['351','山西省','太原市','大同市','阳泉市','长治市','晋城市','朔州市','晋中市','运城市','忻州市','临汾市','吕梁市']
,['471','内蒙古自治区','呼和浩特市','包头市','乌海市','赤峰市','通辽市','鄂尔多斯市','呼伦贝尔市','兴安盟','锡林郭勒盟','乌兰察布市','阿拉善盟','巴彦淖尔市']
,['240','辽宁省','沈阳市','大连市','鞍山市','抚顺市','本溪市','丹东市','锦州市','营口市','阜新市','辽阳市','盘锦市','铁岭市','朝阳市','葫芦岛市']
,['431','吉林省','长春市','吉林市','四平市','辽源市','通化市','白山市','松原市','白城市','延边朝鲜族自治州']
,['451','黑龙江省','哈尔滨市','齐齐哈尔市','鸡西市','鹤岗市','双鸭山市','大庆市','伊春市','佳木斯市','七台河市','牡丹江市','黑河市','绥化市','大兴安岭地区']
,['250','江苏省','南京市','无锡市','徐州市','常州市','苏州市','南通市','连云港市','淮安市','盐城市','扬州市','镇江市','泰州市','宿迁市']
,['571','浙江省','杭州市','宁波市','温州市','嘉兴市','湖州市','绍兴市','金华市','衢州市','舟山市','台州市','丽水市']
,['551','安徽省','合肥市','芜湖市','蚌埠市','淮南市','马鞍山市','淮北市','铜陵市','安庆市','黄山市','滁州市','阜阳市','宿州市','六安市','亳州市','池州市','宣城市']
,['591','福建省','福州市','厦门市','莆田市','三明市','泉州市','漳州市','南平市','龙岩市','宁德市']
,['791','江西省','南昌市','景德镇市','萍乡市','九江市','新余市','鹰潭市','赣州市','吉安市','宜春市','抚州市','上饶市']
,['531','山东省','济南市','青岛市','淄博市','枣庄市','东营市','烟台市','潍坊市','济宁市','泰安市','威海市','日照市','莱芜市','临沂市','德州市','聊城市','滨州市','菏泽市']
,['371','河南省','郑州市','开封市','洛阳市','平顶山市','安阳市','鹤壁市','新乡市','焦作市','濮阳市','许昌市','漯河市','三门峡市','南阳市','商丘市','信阳市','周口市','驻马店市','济源市']
,['270','湖北省','武汉市','黄石市','十堰市','宜昌市','襄樊市','鄂州市','荆门市','孝感市','荆州市','黄冈市','咸宁市','随州市','恩施土家族苗族自治州','仙桃市','潜江市','天门市']
,['731','湖南省','长沙市','株洲市','湘潭市','衡阳市','邵阳市','岳阳市','常德市','张家界市','益阳市','郴州市','永州市','怀化市','娄底市','湘西土家族苗族自治州']
,['200','广东省','广州市','韶关市','深圳市','珠海市','汕头市','佛山市','江门市','湛江市','茂名市','肇庆市','惠州市','梅州市','汕尾市','河源市','阳江市','清远市','东莞市','中山市','潮州市','揭阳市','云浮市']
,['771','广西壮族自治区','南宁市','柳州市','桂林市','梧州市','北海市','防城港市','钦州市','贵港市','玉林市','百色市','贺州市','河池市','来宾市','崇左市']
,['898','海南省','海口市','三亚市','五指山市','琼海市','儋州市','文昌市','万宁市','东方市','定安县','屯昌县','澄迈县','临高县','白沙','昌江','乐东','陵水','保亭','琼中']
,['280','四川省','成都市','自贡市','攀枝花市','泸州市','德阳市','绵阳市','广元市','遂宁市','内江市','乐山市','南充市','眉山市','宜宾市','广安市','达州市','雅安市','巴中市','资阳市','阿坝','甘孜','凉山']
,['851','贵州省','贵阳市','六盘水市','遵义市','安顺市','黔西南布依族苗族自治州','毕节地区','黔东南苗族侗族自治州','黔南布依族苗族自治州','铜仁']
,['871','云南省','昆明市','曲靖市','玉溪市','保山市','昭通市','丽江市','楚雄','红河','文山','普洱市','西双版纳','大理','德宏傣族景颇族自治州','怒江','迪庆藏族自治州','临沧市']
,['891','西藏自治区','拉萨市','昌都地区','山南地区','日喀则地区','那曲地区','阿里地区','林芝地区']
,['290','陕西省','西安市','铜川市','宝鸡市','咸阳市','渭南市','延安市','汉中市','榆林市','安康市','商洛市']
,['931','甘肃省','兰州市','嘉峪关市','金昌市','白银市','天水市','武威市','张掖市','平凉市','酒泉市','庆阳市','定西市','陇南市','临夏回族自治州','甘南藏族自治州']
,['971','青海省','西宁市','海东地区','海北','黄南','海南自治州','果洛','玉树','海西','格尔木市']
,['991','维吾尔','乌鲁木齐市','克拉玛依','吐鲁番','哈密','昌吉','博尔塔拉','巴音郭楞','阿克苏','克孜勒苏柯尔克孜','喀什','和田','伊犁哈萨克','塔城','阿勒泰','石河子','五家渠','阿拉尔','图木舒克']
,['951','宁夏','银川市','固原市','石嘴山市','吴忠市','中卫市']
];


//根据城市名取ccid
function getCCIDByCity(strCity){
	if( typeof strCity == "undefined" || strCity == null || strCity == "" ) return "";
	for( var i = 0 ; i < arShengCity.length ; i ++){
		var cityList = arShengCity[i];
		for(var j=1;j<cityList.length;j++){
			if(strCity == cityList[j]){
				return cityList[0];
				break;
			}
		}
	}
	return "";
}


//根据CCID得城市名称
function getCityNameByCCID(strCCID)
{
	if( typeof strCCID == "undefined" || strCCID == null || strCCID.length < 1 ) return null;
	
	for( var i = 0 ; i < arPyIndex.length ; i ++)
	{
		for(var j=0;j<arPyIndex[i].length;j++){
			if( trim(strCCID) == arPyIndex[i][j][3] ) 
			{
				return arPyIndex[i][j][2];
			}
		}
	}
	return null;
}

//根据CCID得到省份包含城市列表
function getCityListByCCID(strCCID)
{
	if( typeof strCCID == "undefined" || strCCID == null || strCCID.length < 1 ) return null;
	
	for( var i = 0 ; i < arShengCity.length ; i ++)
	{
		if( trim(strCCID) == arShengCity[i][0] ) 
		{
			return arShengCity[i];
		}
	}
	return null;
}
//根据省名称得到省份包含城市列表
function getCityListByName(strCCID)
{
	if( typeof strCCID == "undefined" || strCCID == null || strCCID.length < 1 ) return null;
	
	for( var i = 0 ; i < arShengCity.length ; i ++)
	{
		if( trim(strCCID) == arShengCity[i][1] ) 
		{
			return arShengCity[i];
		}
	}
	return null;
}

//去掉首尾空格
function   trimstr(s)   {   
      var   i;   
      for   (i   =   0;   i   <   s.length   &&   s.charCodeAt(i)   ==   32;   i   ++);   
      s   =   s.substring(i,   s.length);   
      for   (i   =   s.length   -   1;   i   >=   0   &&   s.charCodeAt(i)   ==   32;   i--);   
      s   =   s.substring(0,   i   +   1);   
      return   s;   
 } 
if(typeof trim == "undefined") trim = trimstr;

//搜索城市，在这个函数中判断输入的是拼音还是汉字
function searchCity(strKey)
{
	if( typeof strKey == "undefined" || strKey == null || strKey.length < 1 ) return null;
	
	var a = trim(strKey).charCodeAt(0);
	if(a > 127 || a < 0 )
		return searchByHZ(strKey);
	else
		return sarchByPY(strKey);
	
}

//按照拼音，或者拼音首字母搜索
function sarchByPY(strPY)
{
	//alert(strPY);
	var arRs = null;
	if( typeof strPY == "undefined" || strPY == null || strPY.length < 1 ) return null;
	var strPYLC = trim(strPY).toLowerCase();
	
	if(isNaN(strPY)) 
	{ 
		var i = 0,nPos = 0,nLen = 0;
		nPos = strPYLC.charCodeAt(0)-97;
		//alert(nPos);
		if(nPos<0 || nPos>25) return null;
		nLen = trim(strPY).length;
		//alert(nLen);
		arRs = new Array();
		for( i = 0 ; i < arPyIndex[nPos].length ; i ++)
		{
			if( strPYLC == arPyIndex[nPos][i][0].substring(0,nLen) || strPYLC == arPyIndex[nPos][i][1].substring(0,nLen) ) 
			{
				arRs.push(arPyIndex[nPos][i]);
				//alert(arPyIndex[nPos][i]);
			}
		}
	}else{
		var i = 0,j=0,nPos = 0,nLen = 0;
		nLen = trim(strPY).length;
		arRs = new Array();
		for( i = 0 ; i < arPyIndex.length ; i ++)
		{
			for(j=0;j<arPyIndex[i].length; j ++){
				if( strPYLC == arPyIndex[i][j][3].substring(0,nLen)) 
					arRs.push(arPyIndex[i][j]);
			}
		}
	}

	if(arRs.length < 1 ) arRs = null;
	return arRs;
}



//按照汉字，
function searchByHZ(strHZ)
{
	var arRs = null;
	if( typeof strHZ == "undefined" || strHZ == null || strHZ.length < 1 ) return null;//汉字最少两个字节

	var strPYLC = trim(strHZ).substring(0,1);
	var i = 0,nPos = -1,nLen = 0;
	
	for( i = 0 ; i < arHZIndex1.length ; i ++)
	{
		if(arHZIndex1[i] == strPYLC)
		{
			nPos = i;
			break;
		}
	}
	if( nPos < 0 ) return null;//没有匹配上第一个汉字就直接返回
	//arHZIndex
	nLen = trim(strHZ).length;
	arRs = new Array();
	//alert(nLen);
	for( i = 0 ; i < arHZIndex[nPos].length ; i ++)
	{//alert(arHZIndex[nPos][i][2].substring(0,nLen));
		if( trim(strHZ) == arHZIndex[nPos][i][2].substring(0,nLen) ) 
		{
			arRs.push(arHZIndex[nPos][i]);
		}
	}
	if(arRs.length < 1 ) arRs = null;
	return arRs;
}




